TEXT_EFFECT_MAP = {
    "红黄火焰综艺花字": {
        "resource_id": "7539407429763796249",
        "effect_id": "7539407429763796249",
        "name": "红黄火焰综艺花字",
        "is_vip": True
    },
    "综艺-黑暗斑驳红色": {
        "resource_id": "7351316503771368713",
        "effect_id": "7351316503771368713",
        "name": "综艺-黑暗斑驳红色",
        "is_vip": True
    },
    "蓝白色立体综艺描边花字": {
        "resource_id": "7403923146862087424",
        "effect_id": "7403923146862087424",
        "name": "蓝白色立体综艺描边花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7527336771223407934",
        "effect_id": "7527336771223407934",
        "name": "花字",
        "is_vip": True
    },
    "黄字橙光花字": {
        "resource_id": "7506878563723840783",
        "effect_id": "7506878563723840783",
        "name": "黄字橙光花字",
        "is_vip": True
    },
    "综艺-我看看 太夸张了吧!!": {
        "resource_id": "7351314020114124068",
        "effect_id": "7351314020114124068",
        "name": "综艺-我看看 太夸张了吧!!",
        "is_vip": True
    },
    "黑色描边花字": {
        "resource_id": "7404884940837473590",
        "effect_id": "7404884940837473590",
        "name": "黑色描边花字",
        "is_vip": True
    },
    "音乐节-超粗描边": {
        "resource_id": "7272728092529986827",
        "effect_id": "7272728092529986827",
        "name": "音乐节-超粗描边",
        "is_vip": True
    },
    "潮酷橙底黄色渐变立体花字": {
        "resource_id": "7160594825933262087",
        "effect_id": "7160594825933262087",
        "name": "潮酷橙底黄色渐变立体花字",
        "is_vip": True
    },
    "美食-肉": {
        "resource_id": "7212892794778668345",
        "effect_id": "7212892794778668345",
        "name": "美食-肉",
        "is_vip": True
    },
    "蓝白渐变立体花字": {
        "resource_id": "7405155739943079178",
        "effect_id": "7405155739943079178",
        "name": "蓝白渐变立体花字",
        "is_vip": True
    },
    "橙黄色描边立体花字": {
        "resource_id": "7477040473454939454",
        "effect_id": "7477040473454939454",
        "name": "橙黄色描边立体花字",
        "is_vip": True
    },
    "动感黄色发光故障风花字": {
        "resource_id": "7406159958045232435",
        "effect_id": "7406159958045232435",
        "name": "动感黄色发光故障风花字",
        "is_vip": True
    },
    "渐变黄红色发光字": {
        "resource_id": "7404758577623289123",
        "effect_id": "7404758577623289123",
        "name": "渐变黄红色发光字",
        "is_vip": True
    },
    "黄色渐变红描边发光字": {
        "resource_id": "7403930784630967604",
        "effect_id": "7403930784630967604",
        "name": "黄色渐变红描边发光字",
        "is_vip": True
    },
    "火焰燃烧花字": {
        "resource_id": "7371391474404986150",
        "effect_id": "7371391474404986150",
        "name": "火焰燃烧花字",
        "is_vip": True
    },
    "618立体": {
        "resource_id": "7508541988401368345",
        "effect_id": "7508541988401368345",
        "name": "618立体",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7545767280450227481",
        "effect_id": "7545767280450227481",
        "name": "花字",
        "is_vip": True
    },
    "渐变黄色立体描边花字": {
        "resource_id": "7404010442118515994",
        "effect_id": "7404010442118515994",
        "name": "渐变黄色立体描边花字",
        "is_vip": True
    },
    "金箔纹理字": {
        "resource_id": "7546806821701504281",
        "effect_id": "7546806821701504281",
        "name": "金箔纹理字",
        "is_vip": True
    },
    "蓝色质感渐变立体": {
        "resource_id": "7406646972330953994",
        "effect_id": "7406646972330953994",
        "name": "蓝色质感渐变立体",
        "is_vip": True
    },
    "蓝字黄背景字": {
        "resource_id": "7431415454515612963",
        "effect_id": "7431415454515612963",
        "name": "蓝字黄背景字",
        "is_vip": True
    },
    "白色蓝边立体花字": {
        "resource_id": "7403728277036125449",
        "effect_id": "7403728277036125449",
        "name": "白色蓝边立体花字",
        "is_vip": True
    },
    "黄色渐变描边花字": {
        "resource_id": "7404668885196131603",
        "effect_id": "7404668885196131603",
        "name": "黄色渐变描边花字",
        "is_vip": True
    },
    "黄色花字": {
        "resource_id": "7508204538659310872",
        "effect_id": "7508204538659310872",
        "name": "黄色花字",
        "is_vip": True
    },
    "白色纹理花字": {
        "resource_id": "7405520166701813018",
        "effect_id": "7405520166701813018",
        "name": "白色纹理花字",
        "is_vip": True
    },
    "蓝色冰块立体花字": {
        "resource_id": "7371423297289866505",
        "effect_id": "7371423297289866505",
        "name": "蓝色冰块立体花字",
        "is_vip": True
    },
    "黄红色渐变立体花字": {
        "resource_id": "7477792820707757336",
        "effect_id": "7477792820707757336",
        "name": "黄红色渐变立体花字",
        "is_vip": True
    },
    "黄橙渐变立体秋日花字": {
        "resource_id": "7533685266033347902",
        "effect_id": "7533685266033347902",
        "name": "黄橙渐变立体秋日花字",
        "is_vip": True
    },
    "红金立体发光花字": {
        "resource_id": "7548286146946616600",
        "effect_id": "7548286146946616600",
        "name": "红金立体发光花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7430745422412549385",
        "effect_id": "7430745422412549385",
        "name": "花字",
        "is_vip": True
    },
    "蓝色渐变花光字": {
        "resource_id": "7406860981114015014",
        "effect_id": "7406860981114015014",
        "name": "蓝色渐变花光字",
        "is_vip": True
    },
    "黄色立体字（秋天）": {
        "resource_id": "7405788077832080659",
        "effect_id": "7405788077832080659",
        "name": "黄色立体字（秋天）",
        "is_vip": True
    },
    "裂缝纹理投影": {
        "resource_id": "7450158325188070668",
        "effect_id": "7450158325188070668",
        "name": "裂缝纹理投影",
        "is_vip": True
    },
    "元旦新年氛围金色闪粉发光花字": {
        "resource_id": "7441868112556739849",
        "effect_id": "7441868112556739849",
        "name": "元旦新年氛围金色闪粉发光花字",
        "is_vip": True
    },
    "红黄描边立体": {
        "resource_id": "7479056232117062937",
        "effect_id": "7479056232117062937",
        "name": "红黄描边立体",
        "is_vip": True
    },
    "金色发光镂空花字": {
        "resource_id": "7406015916380605733",
        "effect_id": "7406015916380605733",
        "name": "金色发光镂空花字",
        "is_vip": True
    },
    "运动教程-花字": {
        "resource_id": "7311259207590776075",
        "effect_id": "7311259207590776075",
        "name": "运动教程-花字",
        "is_vip": True
    },
    "综艺风红色渐变纹理立体花字": {
        "resource_id": "7478970969026022680",
        "effect_id": "7478970969026022680",
        "name": "综艺风红色渐变纹理立体花字",
        "is_vip": True
    },
    "蓝色立体描边文字": {
        "resource_id": "7406221865171111208",
        "effect_id": "7406221865171111208",
        "name": "蓝色立体描边文字",
        "is_vip": True
    },
    "25元旦-晕染红描边": {
        "resource_id": "7447932873845247286",
        "effect_id": "7447932873845247286",
        "name": "25元旦-晕染红描边",
        "is_vip": True
    },
    "蓝色蜡笔纹理立体花字": {
        "resource_id": "7404700591949204799",
        "effect_id": "7404700591949204799",
        "name": "蓝色蜡笔纹理立体花字",
        "is_vip": True
    },
    "粉笔拼贴花字（教师节）": {
        "resource_id": "7403915995569474870",
        "effect_id": "7403915995569474870",
        "name": "粉笔拼贴花字（教师节）",
        "is_vip": True
    },
    "黄色渐变粉蓝描边立体花字": {
        "resource_id": "7523881114054970648",
        "effect_id": "7523881114054970648",
        "name": "黄色渐变粉蓝描边立体花字",
        "is_vip": True
    },
    "蓝色花字": {
        "resource_id": "7480494571168795966",
        "effect_id": "7480494571168795966",
        "name": "蓝色花字",
        "is_vip": True
    },
    "轻复古": {
        "resource_id": "7350889130865265970",
        "effect_id": "7350889130865265970",
        "name": "轻复古",
        "is_vip": True
    },
    "综艺 红色渐变": {
        "resource_id": "7127681027346058503",
        "effect_id": "7127681027346058503",
        "name": "综艺 红色渐变",
        "is_vip": True
    },
    "蓝白霓虹灯镂空效果发光花字": {
        "resource_id": "7404140347892305202",
        "effect_id": "7404140347892305202",
        "name": "蓝白霓虹灯镂空效果发光花字",
        "is_vip": True
    },
    "黄色立体描边多彩花字": {
        "resource_id": "7404837954532789523",
        "effect_id": "7404837954532789523",
        "name": "黄色立体描边多彩花字",
        "is_vip": True
    },
    "黄字彩色多层投影文字": {
        "resource_id": "7406655431940033792",
        "effect_id": "7406655431940033792",
        "name": "黄字彩色多层投影文字",
        "is_vip": True
    },
    "红色紫色渐变立体描边花字": {
        "resource_id": "7506824081531243801",
        "effect_id": "7506824081531243801",
        "name": "红色紫色渐变立体描边花字",
        "is_vip": True
    },
    "黄色渐变立体花字": {
        "resource_id": "7347907413363789094",
        "effect_id": "7347907413363789094",
        "name": "黄色渐变立体花字",
        "is_vip": True
    },
    "美食-发光白": {
        "resource_id": "7212896770370571557",
        "effect_id": "7212896770370571557",
        "name": "美食-发光白",
        "is_vip": True
    },
    "复古橙黄渐变醒目": {
        "resource_id": "7400711954731371786",
        "effect_id": "7400711954731371786",
        "name": "复古橙黄渐变醒目",
        "is_vip": True
    },
    "冬至立体": {
        "resource_id": "7430861390933413130",
        "effect_id": "7430861390933413130",
        "name": "冬至立体",
        "is_vip": True
    },
    "黑底白色立体花字": {
        "resource_id": "7278242937488690493",
        "effect_id": "7278242937488690493",
        "name": "黑底白色立体花字",
        "is_vip": True
    },
    "金边浮雕文字": {
        "resource_id": "7405521516131093795",
        "effect_id": "7405521516131093795",
        "name": "金边浮雕文字",
        "is_vip": True
    },
    "橘黄色渐变温柔发光花字": {
        "resource_id": "7467426470714051902",
        "effect_id": "7467426470714051902",
        "name": "橘黄色渐变温柔发光花字",
        "is_vip": True
    },
    "蓝色闪粉星光闪闪发光划走": {
        "resource_id": "7496504150797274393",
        "effect_id": "7496504150797274393",
        "name": "蓝色闪粉星光闪闪发光划走",
        "is_vip": True
    },
    "上下错落发光花字": {
        "resource_id": "7368866329337580851",
        "effect_id": "7368866329337580851",
        "name": "上下错落发光花字",
        "is_vip": True
    },
    "蓝色立体": {
        "resource_id": "7362931435809901859",
        "effect_id": "7362931435809901859",
        "name": "蓝色立体",
        "is_vip": True
    },
    "蓝字白边蓝光花字": {
        "resource_id": "7231501825311116577",
        "effect_id": "7231501825311116577",
        "name": "蓝字白边蓝光花字",
        "is_vip": True
    },
    "岩石花字": {
        "resource_id": "7477883005953051928",
        "effect_id": "7477883005953051928",
        "name": "岩石花字",
        "is_vip": True
    },
    "618-红紫渐变": {
        "resource_id": "7375227839542480191",
        "effect_id": "7375227839542480191",
        "name": "618-红紫渐变",
        "is_vip": True
    },
    "简约黄蓝方块综艺花字": {
        "resource_id": "7494576393569733913",
        "effect_id": "7494576393569733913",
        "name": "简约黄蓝方块综艺花字",
        "is_vip": True
    },
    "红色": {
        "resource_id": "7511243674546867518",
        "effect_id": "7511243674546867518",
        "name": "红色",
        "is_vip": True
    },
    "运动教程-花字": {
        "resource_id": "7311259516392197439",
        "effect_id": "7311259516392197439",
        "name": "运动教程-花字",
        "is_vip": True
    },
    "3D蓝字黄边立体综艺花字": {
        "resource_id": "7404134454844788018",
        "effect_id": "7404134454844788018",
        "name": "3D蓝字黄边立体综艺花字",
        "is_vip": True
    },
    "黄色渐变纹理粉蓝立体花字": {
        "resource_id": "7485579082764225817",
        "effect_id": "7485579082764225817",
        "name": "黄色渐变纹理粉蓝立体花字",
        "is_vip": True
    },
    "JP冬日-结霜字": {
        "resource_id": "7303813440127126836",
        "effect_id": "7303813440127126836",
        "name": "JP冬日-结霜字",
        "is_vip": True
    },
    "红粉渐变花字": {
        "resource_id": "7405872381320842515",
        "effect_id": "7405872381320842515",
        "name": "红粉渐变花字",
        "is_vip": True
    },
    "紫色阴森情绪发光花字": {
        "resource_id": "7406170424935058726",
        "effect_id": "7406170424935058726",
        "name": "紫色阴森情绪发光花字",
        "is_vip": True
    },
    "黄底字": {
        "resource_id": "7343614179732966691",
        "effect_id": "7343614179732966691",
        "name": "黄底字",
        "is_vip": True
    },
    "黄色渐变立体花字": {
        "resource_id": "7298566943722851594",
        "effect_id": "7298566943722851594",
        "name": "黄色渐变立体花字",
        "is_vip": True
    },
    "红黄渐变背景花字": {
        "resource_id": "7404440675225292083",
        "effect_id": "7404440675225292083",
        "name": "红黄渐变背景花字",
        "is_vip": True
    },
    "渐变黄字红边星光立体花字": {
        "resource_id": "7404352881861659931",
        "effect_id": "7404352881861659931",
        "name": "渐变黄字红边星光立体花字",
        "is_vip": True
    },
    "黄紫撞色复古立体字": {
        "resource_id": "7405221368561700148",
        "effect_id": "7405221368561700148",
        "name": "黄紫撞色复古立体字",
        "is_vip": True
    },
    "霓虹灯花字": {
        "resource_id": "7404008412607958323",
        "effect_id": "7404008412607958323",
        "name": "霓虹灯花字",
        "is_vip": True
    },
    "红色渐变白霜立体花字": {
        "resource_id": "7308367002253544741",
        "effect_id": "7308367002253544741",
        "name": "红色渐变白霜立体花字",
        "is_vip": True
    },
    "红色复古投影字": {
        "resource_id": "7405906746461424930",
        "effect_id": "7405906746461424930",
        "name": "红色复古投影字",
        "is_vip": True
    },
    "像素化花字": {
        "resource_id": "7488151895048211736",
        "effect_id": "7488151895048211736",
        "name": "像素化花字",
        "is_vip": True
    },
    "蓝橙色立体花字": {
        "resource_id": "7492933140210666776",
        "effect_id": "7492933140210666776",
        "name": "蓝橙色立体花字",
        "is_vip": True
    },
    "拼贴多色": {
        "resource_id": "7360526293596671273",
        "effect_id": "7360526293596671273",
        "name": "拼贴多色",
        "is_vip": True
    },
    "黄蓝紫渐变立体花字": {
        "resource_id": "7546405848860511513",
        "effect_id": "7546405848860511513",
        "name": "黄蓝紫渐变立体花字",
        "is_vip": True
    },
    "复古红色发光立体花字": {
        "resource_id": "7160599091750161671",
        "effect_id": "7160599091750161671",
        "name": "复古红色发光立体花字",
        "is_vip": True
    },
    "综艺红黄立体": {
        "resource_id": "7434585603439742218",
        "effect_id": "7434585603439742218",
        "name": "综艺红黄立体",
        "is_vip": True
    },
    "综艺-巅峰 厉害!!真是太火爆了!!!2": {
        "resource_id": "7351319129124506930",
        "effect_id": "7351319129124506930",
        "name": "综艺-巅峰 厉害!!真是太火爆了!!!2",
        "is_vip": True
    },
    "黄红蓝边立体花字": {
        "resource_id": "7525867881331215640",
        "effect_id": "7525867881331215640",
        "name": "黄红蓝边立体花字",
        "is_vip": True
    },
    "复古黄色立体": {
        "resource_id": "7406970077368618274",
        "effect_id": "7406970077368618274",
        "name": "复古黄色立体",
        "is_vip": True
    },
    "黄蓝立体字": {
        "resource_id": "7431490038736702760",
        "effect_id": "7431490038736702760",
        "name": "黄蓝立体字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7533790251915955518",
        "effect_id": "7533790251915955518",
        "name": "花字",
        "is_vip": True
    },
    "黄色霓虹灯发光花字": {
        "resource_id": "7408956728529751333",
        "effect_id": "7408956728529751333",
        "name": "黄色霓虹灯发光花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7532883085390548286",
        "effect_id": "7532883085390548286",
        "name": "花字",
        "is_vip": True
    },
    "黄色马卡龙": {
        "resource_id": "7509743284898794777",
        "effect_id": "7509743284898794777",
        "name": "黄色马卡龙",
        "is_vip": True
    },
    "撞色描边立体字": {
        "resource_id": "7406334288930557218",
        "effect_id": "7406334288930557218",
        "name": "撞色描边立体字",
        "is_vip": True
    },
    "游戏像素文字效果花字": {
        "resource_id": "7405871504769961254",
        "effect_id": "7405871504769961254",
        "name": "游戏像素文字效果花字",
        "is_vip": True
    },
    "粉色立体字": {
        "resource_id": "7475271686095506712",
        "effect_id": "7475271686095506712",
        "name": "粉色立体字",
        "is_vip": True
    },
    "霓虹灯花字": {
        "resource_id": "7330423055900069155",
        "effect_id": "7330423055900069155",
        "name": "霓虹灯花字",
        "is_vip": True
    },
    "黄色红色": {
        "resource_id": "7389147072064179506",
        "effect_id": "7389147072064179506",
        "name": "黄色红色",
        "is_vip": True
    },
    "红樱桃": {
        "resource_id": "7539187400808123672",
        "effect_id": "7539187400808123672",
        "name": "红樱桃",
        "is_vip": True
    },
    "粉紫描边立体": {
        "resource_id": "7474511004676803902",
        "effect_id": "7474511004676803902",
        "name": "粉紫描边立体",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7495665652816956697",
        "effect_id": "7495665652816956697",
        "name": "花字",
        "is_vip": True
    },
    "渐变黄色中秋圆底花字": {
        "resource_id": "7405070516706381092",
        "effect_id": "7405070516706381092",
        "name": "渐变黄色中秋圆底花字",
        "is_vip": True
    },
    "复古背景字": {
        "resource_id": "7430809868333780259",
        "effect_id": "7430809868333780259",
        "name": "复古背景字",
        "is_vip": True
    },
    "蓝紫色粗体描边花字": {
        "resource_id": "7259922491185958203",
        "effect_id": "7259922491185958203",
        "name": "蓝紫色粗体描边花字",
        "is_vip": True
    },
    "黄绿发光字": {
        "resource_id": "7403962881252805903",
        "effect_id": "7403962881252805903",
        "name": "黄绿发光字",
        "is_vip": True
    },
    "粉蓝色渐变立体发光花字": {
        "resource_id": "7366086107366182153",
        "effect_id": "7366086107366182153",
        "name": "粉蓝色渐变立体发光花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7525463353603640601",
        "effect_id": "7525463353603640601",
        "name": "花字",
        "is_vip": True
    },
    "粉色描边白色字": {
        "resource_id": "7474605929825193240",
        "effect_id": "7474605929825193240",
        "name": "粉色描边白色字",
        "is_vip": True
    },
    "穿搭立体": {
        "resource_id": "7536671491740634392",
        "effect_id": "7536671491740634392",
        "name": "穿搭立体",
        "is_vip": True
    },
    "好物美妆-黄白跳色": {
        "resource_id": "7264547410817387795",
        "effect_id": "7264547410817387795",
        "name": "好物美妆-黄白跳色",
        "is_vip": True
    },
    "绿色东南亚": {
        "resource_id": "7411032759457631515",
        "effect_id": "7411032759457631515",
        "name": "绿色东南亚",
        "is_vip": True
    },
    "蓝色纸纹纹理花字": {
        "resource_id": "7520663448003415358",
        "effect_id": "7520663448003415358",
        "name": "蓝色纸纹纹理花字",
        "is_vip": True
    },
    "红黄渐变发光字": {
        "resource_id": "7406976068789210403",
        "effect_id": "7406976068789210403",
        "name": "红黄渐变发光字",
        "is_vip": True
    },
    "粉色星空花字": {
        "resource_id": "7396798321739730226",
        "effect_id": "7396798321739730226",
        "name": "粉色星空花字",
        "is_vip": True
    },
    "粉色立体字": {
        "resource_id": "7404321887817452800",
        "effect_id": "7404321887817452800",
        "name": "粉色立体字",
        "is_vip": True
    },
    "金属划痕暗黑立体字": {
        "resource_id": "7405501393248881960",
        "effect_id": "7405501393248881960",
        "name": "金属划痕暗黑立体字",
        "is_vip": True
    },
    "粉色": {
        "resource_id": "7507145578984361241",
        "effect_id": "7507145578984361241",
        "name": "粉色",
        "is_vip": True
    },
    "橘黄色立体字": {
        "resource_id": "7407078807309503744",
        "effect_id": "7407078807309503744",
        "name": "橘黄色立体字",
        "is_vip": True
    },
    "双色爱心花字": {
        "resource_id": "7362054905256758591",
        "effect_id": "7362054905256758591",
        "name": "双色爱心花字",
        "is_vip": True
    },
    "三花猫配色": {
        "resource_id": "7532428202199797016",
        "effect_id": "7532428202199797016",
        "name": "三花猫配色",
        "is_vip": True
    },
    "绿色立体花字": {
        "resource_id": "7477511783801163032",
        "effect_id": "7477511783801163032",
        "name": "绿色立体花字",
        "is_vip": True
    },
    "高级幻彩花紫字": {
        "resource_id": "7293329973694172435",
        "effect_id": "7293329973694172435",
        "name": "高级幻彩花紫字",
        "is_vip": True
    },
    "红绿撞色发光字": {
        "resource_id": "7406650793631223075",
        "effect_id": "7406650793631223075",
        "name": "红绿撞色发光字",
        "is_vip": True
    },
    "绿色发光花字": {
        "resource_id": "7265723229216525620",
        "effect_id": "7265723229216525620",
        "name": "绿色发光花字",
        "is_vip": True
    },
    "绿色渐变背景字": {
        "resource_id": "7404290078723312931",
        "effect_id": "7404290078723312931",
        "name": "绿色渐变背景字",
        "is_vip": True
    },
    "蓝绿纹理花字": {
        "resource_id": "7527597707930799422",
        "effect_id": "7527597707930799422",
        "name": "蓝绿纹理花字",
        "is_vip": True
    },
    "粉色立体渐变": {
        "resource_id": "7376607395046231331",
        "effect_id": "7376607395046231331",
        "name": "粉色立体渐变",
        "is_vip": True
    },
    "黄色立体花字": {
        "resource_id": "7405087980685167922",
        "effect_id": "7405087980685167922",
        "name": "黄色立体花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7478268728992419096",
        "effect_id": "7478268728992419096",
        "name": "花字",
        "is_vip": True
    },
    "#花字招募令 彩虹花字": {
        "resource_id": "7398456039634406666",
        "effect_id": "7398456039634406666",
        "name": "#花字招募令 彩虹花字",
        "is_vip": True
    },
    "少女粉星星花字": {
        "resource_id": "7404459246961577257",
        "effect_id": "7404459246961577257",
        "name": "少女粉星星花字",
        "is_vip": True
    },
    "未来科技感发光花字": {
        "resource_id": "7404471553607421222",
        "effect_id": "7404471553607421222",
        "name": "未来科技感发光花字",
        "is_vip": True
    },
    "潮流紫色荧光花字": {
        "resource_id": "7241759007952735491",
        "effect_id": "7241759007952735491",
        "name": "潮流紫色荧光花字",
        "is_vip": True
    },
    "橙色渐变花字": {
        "resource_id": "7404263174230297882",
        "effect_id": "7404263174230297882",
        "name": "橙色渐变花字",
        "is_vip": True
    },
    "可爱花字": {
        "resource_id": "7430667459683831079",
        "effect_id": "7430667459683831079",
        "name": "可爱花字",
        "is_vip": True
    },
    "渐变综艺发光花字": {
        "resource_id": "7539752808367574297",
        "effect_id": "7539752808367574297",
        "name": "渐变综艺发光花字",
        "is_vip": True
    },
    "橙色万圣花字": {
        "resource_id": "7293140122332122368",
        "effect_id": "7293140122332122368",
        "name": "橙色万圣花字",
        "is_vip": True
    },
    "棕色立体粗描边": {
        "resource_id": "7406388990837886234",
        "effect_id": "7406388990837886234",
        "name": "棕色立体粗描边",
        "is_vip": True
    },
    "立体字": {
        "resource_id": "7260043007997562149",
        "effect_id": "7260043007997562149",
        "name": "立体字",
        "is_vip": True
    },
    "酸性质感花字": {
        "resource_id": "7481664682638560537",
        "effect_id": "7481664682638560537",
        "name": "酸性质感花字",
        "is_vip": True
    },
    "绿色渐变立体花字": {
        "resource_id": "7492430244570303806",
        "effect_id": "7492430244570303806",
        "name": "绿色渐变立体花字",
        "is_vip": True
    },
    "赛博朋克风故障字": {
        "resource_id": "7404304312135896360",
        "effect_id": "7404304312135896360",
        "name": "赛博朋克风故障字",
        "is_vip": True
    },
    "粉色立体花字": {
        "resource_id": "7404522256929459494",
        "effect_id": "7404522256929459494",
        "name": "粉色立体花字",
        "is_vip": True
    },
    "粉橙立体花字": {
        "resource_id": "7475398432807521561",
        "effect_id": "7475398432807521561",
        "name": "粉橙立体花字",
        "is_vip": True
    },
    "复古牛皮纸花字": {
        "resource_id": "7362833837627378944",
        "effect_id": "7362833837627378944",
        "name": "复古牛皮纸花字",
        "is_vip": True
    },
    "黑色纹理立体花字": {
        "resource_id": "7306894668795612442",
        "effect_id": "7306894668795612442",
        "name": "黑色纹理立体花字",
        "is_vip": True
    },
    "圆环花字": {
        "resource_id": "7349078136480386345",
        "effect_id": "7349078136480386345",
        "name": "圆环花字",
        "is_vip": True
    },
    "薰衣草": {
        "resource_id": "7509044952912055614",
        "effect_id": "7509044952912055614",
        "name": "薰衣草",
        "is_vip": True
    },
    "清新条纹投影纹理花字": {
        "resource_id": "7404757226583362854",
        "effect_id": "7404757226583362854",
        "name": "清新条纹投影纹理花字",
        "is_vip": True
    },
    "马卡龙色渐变文字": {
        "resource_id": "7406238235141213440",
        "effect_id": "7406238235141213440",
        "name": "马卡龙色渐变文字",
        "is_vip": True
    },
    "白字红光花字": {
        "resource_id": "7351431205692181786",
        "effect_id": "7351431205692181786",
        "name": "白字红光花字",
        "is_vip": True
    },
    "纹理花字": {
        "resource_id": "7333249201419160868",
        "effect_id": "7333249201419160868",
        "name": "纹理花字",
        "is_vip": True
    },
    "描边橙色黄色双色立体花字": {
        "resource_id": "7405049138867424523",
        "effect_id": "7405049138867424523",
        "name": "描边橙色黄色双色立体花字",
        "is_vip": True
    },
    "粉色渐变": {
        "resource_id": "7491540791689530686",
        "effect_id": "7491540791689530686",
        "name": "粉色渐变",
        "is_vip": True
    },
    "黄粉色立体渐变花字": {
        "resource_id": "7371110382393494793",
        "effect_id": "7371110382393494793",
        "name": "黄粉色立体渐变花字",
        "is_vip": True
    },
    "低饱和紫色渐变综艺花字": {
        "resource_id": "7388017781117160745",
        "effect_id": "7388017781117160745",
        "name": "低饱和紫色渐变综艺花字",
        "is_vip": True
    },
    "莫兰迪清新蓝色描边花字": {
        "resource_id": "7404083693003853096",
        "effect_id": "7404083693003853096",
        "name": "莫兰迪清新蓝色描边花字",
        "is_vip": True
    },
    "节日花字": {
        "resource_id": "7405888865132711220",
        "effect_id": "7405888865132711220",
        "name": "节日花字",
        "is_vip": True
    },
    "3D多层渐变红": {
        "resource_id": "7174401031399312670",
        "effect_id": "7174401031399312670",
        "name": "3D多层渐变红",
        "is_vip": True
    },
    "红色": {
        "resource_id": "7389185223600114995",
        "effect_id": "7389185223600114995",
        "name": "红色",
        "is_vip": True
    },
    "多色渐变花字": {
        "resource_id": "7405856965332585764",
        "effect_id": "7405856965332585764",
        "name": "多色渐变花字",
        "is_vip": True
    },
    "3D腮绿": {
        "resource_id": "7173927171881323789",
        "effect_id": "7173927171881323789",
        "name": "3D腮绿",
        "is_vip": True
    },
    "黄色渐变纹理花字": {
        "resource_id": "7431429108791266611",
        "effect_id": "7431429108791266611",
        "name": "黄色渐变纹理花字",
        "is_vip": True
    },
    "黄绿色立体纹理花字": {
        "resource_id": "7404772432323546422",
        "effect_id": "7404772432323546422",
        "name": "黄绿色立体纹理花字",
        "is_vip": True
    },
    "白字橘色描边立体花字": {
        "resource_id": "7371117571757641011",
        "effect_id": "7371117571757641011",
        "name": "白字橘色描边立体花字",
        "is_vip": True
    },
    "蓝色纹理白描边花字": {
        "resource_id": "7378313478852906280",
        "effect_id": "7378313478852906280",
        "name": "蓝色纹理白描边花字",
        "is_vip": True
    },
    "桃红色渐变立体花字": {
        "resource_id": "7388024664980770060",
        "effect_id": "7388024664980770060",
        "name": "桃红色渐变立体花字",
        "is_vip": True
    },
    "潮酷粉黄撞色立体花字": {
        "resource_id": "7404058441481866511",
        "effect_id": "7404058441481866511",
        "name": "潮酷粉黄撞色立体花字",
        "is_vip": True
    },
    "复古镂空花字": {
        "resource_id": "7345391635267603753",
        "effect_id": "7345391635267603753",
        "name": "复古镂空花字",
        "is_vip": True
    },
    "粉黄渐变立体字": {
        "resource_id": "7405944611430092066",
        "effect_id": "7405944611430092066",
        "name": "粉黄渐变立体字",
        "is_vip": True
    },
    "绿橙花字": {
        "resource_id": "7392196588426382629",
        "effect_id": "7392196588426382629",
        "name": "绿橙花字",
        "is_vip": True
    },
    "中式背景框文字": {
        "resource_id": "7406225575712443663",
        "effect_id": "7406225575712443663",
        "name": "中式背景框文字",
        "is_vip": True
    },
    "彩色花边花字": {
        "resource_id": "7366911458824752410",
        "effect_id": "7366911458824752410",
        "name": "彩色花边花字",
        "is_vip": True
    },
    "节日粉色渐变立体描边花字": {
        "resource_id": "7539491294188440857",
        "effect_id": "7539491294188440857",
        "name": "节日粉色渐变立体描边花字",
        "is_vip": True
    },
    "黄绿综艺花字": {
        "resource_id": "7476505479364201753",
        "effect_id": "7476505479364201753",
        "name": "黄绿综艺花字",
        "is_vip": True
    },
    "抹茶绿多层描边立体花字": {
        "resource_id": "7405039371037986089",
        "effect_id": "7405039371037986089",
        "name": "抹茶绿多层描边立体花字",
        "is_vip": True
    },
    "粉紫色渐变立体发光花字": {
        "resource_id": "7407013513979251978",
        "effect_id": "7407013513979251978",
        "name": "粉紫色渐变立体发光花字",
        "is_vip": True
    },
    "红粉色渐变立体发光花字": {
        "resource_id": "7475276656626863385",
        "effect_id": "7475276656626863385",
        "name": "红粉色渐变立体发光花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7543043727103675673",
        "effect_id": "7543043727103675673",
        "name": "花字",
        "is_vip": True
    },
    "粉色亮晶晶花字": {
        "resource_id": "7265614497119735040",
        "effect_id": "7265614497119735040",
        "name": "粉色亮晶晶花字",
        "is_vip": True
    },
    "樱花粉 粉色花字": {
        "resource_id": "7336859597287804169",
        "effect_id": "7336859597287804169",
        "name": "樱花粉 粉色花字",
        "is_vip": True
    },
    "蓝绿立体花字": {
        "resource_id": "7405924713400126747",
        "effect_id": "7405924713400126747",
        "name": "蓝绿立体花字",
        "is_vip": True
    },
    "万圣紫色花字": {
        "resource_id": "7293778917603822848",
        "effect_id": "7293778917603822848",
        "name": "万圣紫色花字",
        "is_vip": True
    },
    "3D粉色立体花字": {
        "resource_id": "7350157127207456037",
        "effect_id": "7350157127207456037",
        "name": "3D粉色立体花字",
        "is_vip": True
    },
    "粉蓝色渐变爱心底花字": {
        "resource_id": "7542084187285703998",
        "effect_id": "7542084187285703998",
        "name": "粉蓝色渐变爱心底花字",
        "is_vip": True
    },
    "五一立体": {
        "resource_id": "7359406447718862131",
        "effect_id": "7359406447718862131",
        "name": "五一立体",
        "is_vip": True
    },
    "粉色紫边立体字": {
        "resource_id": "7409954407321783586",
        "effect_id": "7409954407321783586",
        "name": "粉色紫边立体字",
        "is_vip": True
    },
    "立体黄蓝纹理花字": {
        "resource_id": "7537970908221394238",
        "effect_id": "7537970908221394238",
        "name": "立体黄蓝纹理花字",
        "is_vip": True
    },
    "3D粉色渐变立体花字": {
        "resource_id": "7403948957547760906",
        "effect_id": "7403948957547760906",
        "name": "3D粉色渐变立体花字",
        "is_vip": True
    },
    "浅蓝黄渐变立体花字": {
        "resource_id": "7312845270671232294",
        "effect_id": "7312845270671232294",
        "name": "浅蓝黄渐变立体花字",
        "is_vip": True
    },
    "复古红色立体花字": {
        "resource_id": "7480506672746794264",
        "effect_id": "7480506672746794264",
        "name": "复古红色立体花字",
        "is_vip": True
    },
    "绿色花字": {
        "resource_id": "7431433243922107689",
        "effect_id": "7431433243922107689",
        "name": "绿色花字",
        "is_vip": True
    },
    "美妆纹理": {
        "resource_id": "7411406288350874917",
        "effect_id": "7411406288350874917",
        "name": "美妆纹理",
        "is_vip": True
    },
    "黄绿花字": {
        "resource_id": "7404294636656774451",
        "effect_id": "7404294636656774451",
        "name": "黄绿花字",
        "is_vip": True
    },
    "糖果色彩色渐变描边花字": {
        "resource_id": "7404705863442713910",
        "effect_id": "7404705863442713910",
        "name": "糖果色彩色渐变描边花字",
        "is_vip": True
    },
    "粉色立体花字": {
        "resource_id": "7298637894481169701",
        "effect_id": "7298637894481169701",
        "name": "粉色立体花字",
        "is_vip": True
    },
    "蓝色渐变花字": {
        "resource_id": "7252284645998464288",
        "effect_id": "7252284645998464288",
        "name": "蓝色渐变花字",
        "is_vip": True
    },
    "纹理花字": {
        "resource_id": "7339054041458036006",
        "effect_id": "7339054041458036006",
        "name": "纹理花字",
        "is_vip": True
    },
    "纹理复古深色字": {
        "resource_id": "7404307108625206563",
        "effect_id": "7404307108625206563",
        "name": "纹理复古深色字",
        "is_vip": True
    },
    "红色描边黄色花字": {
        "resource_id": "7404774919315197195",
        "effect_id": "7404774919315197195",
        "name": "红色描边黄色花字",
        "is_vip": True
    },
    "白字黑边裂痕综艺花字": {
        "resource_id": "7404884426150235418",
        "effect_id": "7404884426150235418",
        "name": "白字黑边裂痕综艺花字",
        "is_vip": True
    },
    "黄字红边立体粗描边花字": {
        "resource_id": "7404394775664708901",
        "effect_id": "7404394775664708901",
        "name": "黄字红边立体粗描边花字",
        "is_vip": True
    },
    "国风水墨": {
        "resource_id": "7405990788053683482",
        "effect_id": "7405990788053683482",
        "name": "国风水墨",
        "is_vip": True
    },
    "火焰立体": {
        "resource_id": "7407352720815836443",
        "effect_id": "7407352720815836443",
        "name": "火焰立体",
        "is_vip": True
    },
    "红色描边纹理立体字": {
        "resource_id": "7405218557342059816",
        "effect_id": "7405218557342059816",
        "name": "红色描边纹理立体字",
        "is_vip": True
    },
    "蓝色渐变阴影立体花字": {
        "resource_id": "7495216846946274584",
        "effect_id": "7495216846946274584",
        "name": "蓝色渐变阴影立体花字",
        "is_vip": True
    },
    "红色立体纹理花字": {
        "resource_id": "7405838293843070234",
        "effect_id": "7405838293843070234",
        "name": "红色立体纹理花字",
        "is_vip": True
    },
    "渐变花字": {
        "resource_id": "7368685720325655817",
        "effect_id": "7368685720325655817",
        "name": "渐变花字",
        "is_vip": True
    },
    "纸质": {
        "resource_id": "7360556929959087397",
        "effect_id": "7360556929959087397",
        "name": "纸质",
        "is_vip": True
    },
    "蓝白色渐变立体花字": {
        "resource_id": "7404520330502458674",
        "effect_id": "7404520330502458674",
        "name": "蓝白色渐变立体花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7547970729258519833",
        "effect_id": "7547970729258519833",
        "name": "花字",
        "is_vip": True
    },
    "蓝色": {
        "resource_id": "7507097456283274520",
        "effect_id": "7507097456283274520",
        "name": "蓝色",
        "is_vip": True
    },
    "黑白线条花字": {
        "resource_id": "7404819849140063551",
        "effect_id": "7404819849140063551",
        "name": "黑白线条花字",
        "is_vip": True
    },
    "愚人节立体": {
        "resource_id": "7482688482754694462",
        "effect_id": "7482688482754694462",
        "name": "愚人节立体",
        "is_vip": True
    },
    "中秋桂花花字": {
        "resource_id": "7406740764207713577",
        "effect_id": "7406740764207713577",
        "name": "中秋桂花花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7455608333563874585",
        "effect_id": "7455608333563874585",
        "name": "花字",
        "is_vip": True
    },
    "双十一红黄立体": {
        "resource_id": "7430822256806284594",
        "effect_id": "7430822256806284594",
        "name": "双十一红黄立体",
        "is_vip": True
    },
    "金色渐变立体红边发光花字": {
        "resource_id": "7459686003079630104",
        "effect_id": "7459686003079630104",
        "name": "金色渐变立体红边发光花字",
        "is_vip": True
    },
    "银色渐变描边发光花字": {
        "resource_id": "7405031205877419305",
        "effect_id": "7405031205877419305",
        "name": "银色渐变描边发光花字",
        "is_vip": True
    },
    "白色立体花字": {
        "resource_id": "7474543369054702910",
        "effect_id": "7474543369054702910",
        "name": "白色立体花字",
        "is_vip": True
    },
    "蓝色渐变镂空描边花字": {
        "resource_id": "7405927551417306378",
        "effect_id": "7405927551417306378",
        "name": "蓝色渐变镂空描边花字",
        "is_vip": True
    },
    "蓝白立体花字": {
        "resource_id": "7405716848106310931",
        "effect_id": "7405716848106310931",
        "name": "蓝白立体花字",
        "is_vip": True
    },
    "白色发光花字": {
        "resource_id": "7371368226606943514",
        "effect_id": "7371368226606943514",
        "name": "白色发光花字",
        "is_vip": True
    },
    "金红纸纹理发光字": {
        "resource_id": "7404877070158908698",
        "effect_id": "7404877070158908698",
        "name": "金红纸纹理发光字",
        "is_vip": True
    },
    "橙白渐变花字 黑白描边花字": {
        "resource_id": "7241953374780804410",
        "effect_id": "7241953374780804410",
        "name": "橙白渐变花字 黑白描边花字",
        "is_vip": True
    },
    "云纹金箔字": {
        "resource_id": "7405518341814668544",
        "effect_id": "7405518341814668544",
        "name": "云纹金箔字",
        "is_vip": True
    },
    "综艺风黄色渐变纹理立体花字": {
        "resource_id": "7478934394141527358",
        "effect_id": "7478934394141527358",
        "name": "综艺风黄色渐变纹理立体花字",
        "is_vip": True
    },
    "蓝红色立体综艺花字": {
        "resource_id": "7371410942061546803",
        "effect_id": "7371410942061546803",
        "name": "蓝红色立体综艺花字",
        "is_vip": True
    },
    "红金国风花字": {
        "resource_id": "7507460201549843736",
        "effect_id": "7507460201549843736",
        "name": "红金国风花字",
        "is_vip": True
    },
    "黄色渐变描边立体花字": {
        "resource_id": "7404667171537767699",
        "effect_id": "7404667171537767699",
        "name": "黄色渐变描边立体花字",
        "is_vip": True
    },
    "白纸纹理蓝阴影花字": {
        "resource_id": "7509041829556522265",
        "effect_id": "7509041829556522265",
        "name": "白纸纹理蓝阴影花字",
        "is_vip": True
    },
    "国风花字": {
        "resource_id": "7406648659976260903",
        "effect_id": "7406648659976260903",
        "name": "国风花字",
        "is_vip": True
    },
    "黑色拼贴方底花字": {
        "resource_id": "7405933257776172314",
        "effect_id": "7405933257776172314",
        "name": "黑色拼贴方底花字",
        "is_vip": True
    },
    "描边字": {
        "resource_id": "7360986749046213928",
        "effect_id": "7360986749046213928",
        "name": "描边字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7465177921276136766",
        "effect_id": "7465177921276136766",
        "name": "花字",
        "is_vip": True
    },
    "点金花字": {
        "resource_id": "7406200724171787574",
        "effect_id": "7406200724171787574",
        "name": "点金花字",
        "is_vip": True
    },
    "白字内发光蓝边字": {
        "resource_id": "7406693646592003366",
        "effect_id": "7406693646592003366",
        "name": "白字内发光蓝边字",
        "is_vip": True
    },
    "米白厚底立体花字": {
        "resource_id": "7371351770045484338",
        "effect_id": "7371351770045484338",
        "name": "米白厚底立体花字",
        "is_vip": True
    },
    "水墨红底白色花字": {
        "resource_id": "7405529606859607347",
        "effect_id": "7405529606859607347",
        "name": "水墨红底白色花字",
        "is_vip": True
    },
    "条纹纹理黄色立体花字": {
        "resource_id": "7404709465209064745",
        "effect_id": "7404709465209064745",
        "name": "条纹纹理黄色立体花字",
        "is_vip": True
    },
    "红色恐怖氛围纹理花字": {
        "resource_id": "7404872280662166834",
        "effect_id": "7404872280662166834",
        "name": "红色恐怖氛围纹理花字",
        "is_vip": True
    },
    "蓝色折纸": {
        "resource_id": "7459675119116373272",
        "effect_id": "7459675119116373272",
        "name": "蓝色折纸",
        "is_vip": True
    },
    "港风立体": {
        "resource_id": "7434560086166490418",
        "effect_id": "7434560086166490418",
        "name": "港风立体",
        "is_vip": True
    },
    "红色发光花字": {
        "resource_id": "7431445423283244297",
        "effect_id": "7431445423283244297",
        "name": "红色发光花字",
        "is_vip": True
    },
    "黄色渐变立体字": {
        "resource_id": "7404696990510042402",
        "effect_id": "7404696990510042402",
        "name": "黄色渐变立体字",
        "is_vip": True
    },
    "蓝莓奶酪": {
        "resource_id": "7506829483878649150",
        "effect_id": "7506829483878649150",
        "name": "蓝莓奶酪",
        "is_vip": True
    },
    "新年立体花字": {
        "resource_id": "7451570972550991166",
        "effect_id": "7451570972550991166",
        "name": "新年立体花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7430745414313332006",
        "effect_id": "7430745414313332006",
        "name": "花字",
        "is_vip": True
    },
    "25元旦-红花背景花字": {
        "resource_id": "7447831886874938678",
        "effect_id": "7447831886874938678",
        "name": "25元旦-红花背景花字",
        "is_vip": True
    },
    "黑色金箔描边立体花字": {
        "resource_id": "7404523157400472869",
        "effect_id": "7404523157400472869",
        "name": "黑色金箔描边立体花字",
        "is_vip": True
    },
    "灰白水墨国风花字": {
        "resource_id": "7405537335850306853",
        "effect_id": "7405537335850306853",
        "name": "灰白水墨国风花字",
        "is_vip": True
    },
    "科技感朋克发光立体标题花字": {
        "resource_id": "7405801186286259466",
        "effect_id": "7405801186286259466",
        "name": "科技感朋克发光立体标题花字",
        "is_vip": True
    },
    "田字格图案蜡笔纹理花字": {
        "resource_id": "7405067510053211446",
        "effect_id": "7405067510053211446",
        "name": "田字格图案蜡笔纹理花字",
        "is_vip": True
    },
    "黄红撞色立体": {
        "resource_id": "7406637506977877299",
        "effect_id": "7406637506977877299",
        "name": "黄红撞色立体",
        "is_vip": True
    },
    "中式背景文字": {
        "resource_id": "7405203982286720256",
        "effect_id": "7405203982286720256",
        "name": "中式背景文字",
        "is_vip": True
    },
    "日综蓝白方框字": {
        "resource_id": "7472013339640614206",
        "effect_id": "7472013339640614206",
        "name": "日综蓝白方框字",
        "is_vip": True
    },
    "综艺蓝黄立体": {
        "resource_id": "7436409520848522546",
        "effect_id": "7436409520848522546",
        "name": "综艺蓝黄立体",
        "is_vip": True
    },
    "水墨风白字黑边红墨点花字": {
        "resource_id": "7405514240779357449",
        "effect_id": "7405514240779357449",
        "name": "水墨风白字黑边红墨点花字",
        "is_vip": True
    },
    "创意立体黄色花字高级感主题文字封面标题字": {
        "resource_id": "7507075178447359282",
        "effect_id": "7507075178447359282",
        "name": "创意立体黄色花字高级感主题文字封面标题字",
        "is_vip": True
    },
    "白色": {
        "resource_id": "7509055757908806937",
        "effect_id": "7509055757908806937",
        "name": "白色",
        "is_vip": True
    },
    "黄字黑边": {
        "resource_id": "7406683118108806437",
        "effect_id": "7406683118108806437",
        "name": "黄字黑边",
        "is_vip": True
    },
    "大理石花纹字": {
        "resource_id": "7411036229677878554",
        "effect_id": "7411036229677878554",
        "name": "大理石花纹字",
        "is_vip": True
    },
    "中秋黄色字": {
        "resource_id": "7404409329991879988",
        "effect_id": "7404409329991879988",
        "name": "中秋黄色字",
        "is_vip": True
    },
    "综艺感黄色立体描边花字": {
        "resource_id": "7481983816001834265",
        "effect_id": "7481983816001834265",
        "name": "综艺感黄色立体描边花字",
        "is_vip": True
    },
    "月饼花字": {
        "resource_id": "7548895672402185497",
        "effect_id": "7548895672402185497",
        "name": "月饼花字",
        "is_vip": True
    },
    "蓝色渐变微立体花字": {
        "resource_id": "7406980293233560859",
        "effect_id": "7406980293233560859",
        "name": "蓝色渐变微立体花字",
        "is_vip": True
    },
    "白字橘色发光花字": {
        "resource_id": "7371372494336396570",
        "effect_id": "7371372494336396570",
        "name": "白字橘色发光花字",
        "is_vip": True
    },
    "几何纹理黑色阴影花字": {
        "resource_id": "7404700217553063209",
        "effect_id": "7404700217553063209",
        "name": "几何纹理黑色阴影花字",
        "is_vip": True
    },
    "悬疑剧字幕": {
        "resource_id": "7411046109285485861",
        "effect_id": "7411046109285485861",
        "name": "悬疑剧字幕",
        "is_vip": True
    },
    "蓝色纹理花字": {
        "resource_id": "7479073211918044441",
        "effect_id": "7479073211918044441",
        "name": "蓝色纹理花字",
        "is_vip": True
    },
    "划重点花字": {
        "resource_id": "7369127125569342731",
        "effect_id": "7369127125569342731",
        "name": "划重点花字",
        "is_vip": True
    },
    "橙色底纹花字": {
        "resource_id": "7533453859830713662",
        "effect_id": "7533453859830713662",
        "name": "橙色底纹花字",
        "is_vip": True
    },
    "雪花图案渐变蓝色立体花字": {
        "resource_id": "7405034038135655719",
        "effect_id": "7405034038135655719",
        "name": "雪花图案渐变蓝色立体花字",
        "is_vip": True
    },
    "蓝色渐变描边简约风格花字": {
        "resource_id": "7455983000291937586",
        "effect_id": "7455983000291937586",
        "name": "蓝色渐变描边简约风格花字",
        "is_vip": True
    },
    "黄色渐变橘色阴影立体花字": {
        "resource_id": "7495033287438781758",
        "effect_id": "7495033287438781758",
        "name": "黄色渐变橘色阴影立体花字",
        "is_vip": True
    },
    "双十一-立体紫色": {
        "resource_id": "7296357486490144036",
        "effect_id": "7296357486490144036",
        "name": "双十一-立体紫色",
        "is_vip": True
    },
    "黄色贴纸描边字效": {
        "resource_id": "7533293069123390744",
        "effect_id": "7533293069123390744",
        "name": "黄色贴纸描边字效",
        "is_vip": True
    },
    "渐变蓝色阴影": {
        "resource_id": "7283715592316554555",
        "effect_id": "7283715592316554555",
        "name": "渐变蓝色阴影",
        "is_vip": True
    },
    "黑白水墨花字": {
        "resource_id": "7405536862133046565",
        "effect_id": "7405536862133046565",
        "name": "黑白水墨花字",
        "is_vip": True
    },
    "复古黄沙水彩纹理花字": {
        "resource_id": "7405517504128273676",
        "effect_id": "7405517504128273676",
        "name": "复古黄沙水彩纹理花字",
        "is_vip": True
    },
    "红色渐变": {
        "resource_id": "7461550488073538841",
        "effect_id": "7461550488073538841",
        "name": "红色渐变",
        "is_vip": True
    },
    "潮酷背景字": {
        "resource_id": "7431460080228257039",
        "effect_id": "7431460080228257039",
        "name": "潮酷背景字",
        "is_vip": True
    },
    "撞色描边字": {
        "resource_id": "7404391553164135715",
        "effect_id": "7404391553164135715",
        "name": "撞色描边字",
        "is_vip": True
    },
    "紫色立体花字": {
        "resource_id": "7406690026009972004",
        "effect_id": "7406690026009972004",
        "name": "紫色立体花字",
        "is_vip": True
    },
    "冬季渐变蓝色立体花字": {
        "resource_id": "7431012567369125161",
        "effect_id": "7431012567369125161",
        "name": "冬季渐变蓝色立体花字",
        "is_vip": True
    },
    "红黄复古浮雕纹理字": {
        "resource_id": "7405414031072169250",
        "effect_id": "7405414031072169250",
        "name": "红黄复古浮雕纹理字",
        "is_vip": True
    },
    "3D渐变橘红色立体花字": {
        "resource_id": "7404702615671508263",
        "effect_id": "7404702615671508263",
        "name": "3D渐变橘红色立体花字",
        "is_vip": True
    },
    "粉蓝渐变花字": {
        "resource_id": "7404522414941424923",
        "effect_id": "7404522414941424923",
        "name": "粉蓝渐变花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7511273485730237758",
        "effect_id": "7511273485730237758",
        "name": "花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7491617722359565630",
        "effect_id": "7491617722359565630",
        "name": "花字",
        "is_vip": True
    },
    "黑紫星空花字": {
        "resource_id": "7405795232748490025",
        "effect_id": "7405795232748490025",
        "name": "黑紫星空花字",
        "is_vip": True
    },
    "冷色调简单花字": {
        "resource_id": "7430642926293732658",
        "effect_id": "7430642926293732658",
        "name": "冷色调简单花字",
        "is_vip": True
    },
    "金色渐变立体花字": {
        "resource_id": "7371420451526020389",
        "effect_id": "7371420451526020389",
        "name": "金色渐变立体花字",
        "is_vip": True
    },
    "红色金箔纹理立体花字": {
        "resource_id": "7404507481205984539",
        "effect_id": "7404507481205984539",
        "name": "红色金箔纹理立体花字",
        "is_vip": True
    },
    "黄蓝撞色纹理立体花字": {
        "resource_id": "7405570848041487666",
        "effect_id": "7405570848041487666",
        "name": "黄蓝撞色纹理立体花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7365356770652376330",
        "effect_id": "7365356770652376330",
        "name": "花字",
        "is_vip": True
    },
    "渐变圆底花字": {
        "resource_id": "7406353145938382130",
        "effect_id": "7406353145938382130",
        "name": "渐变圆底花字",
        "is_vip": True
    },
    "白字蓝粉相间底色花字": {
        "resource_id": "7444510136296541465",
        "effect_id": "7444510136296541465",
        "name": "白字蓝粉相间底色花字",
        "is_vip": True
    },
    "综艺风黄色立体描边花字": {
        "resource_id": "7505458612001852697",
        "effect_id": "7505458612001852697",
        "name": "综艺风黄色立体描边花字",
        "is_vip": True
    },
    "蓝色纸张质感立体花字": {
        "resource_id": "7430855417703435529",
        "effect_id": "7430855417703435529",
        "name": "蓝色纸张质感立体花字",
        "is_vip": True
    },
    "彩色带图案花字": {
        "resource_id": "7407037141584203059",
        "effect_id": "7407037141584203059",
        "name": "彩色带图案花字",
        "is_vip": True
    },
    "红蓝橙描边立体花字": {
        "resource_id": "7481302843849329982",
        "effect_id": "7481302843849329982",
        "name": "红蓝橙描边立体花字",
        "is_vip": True
    },
    "红色印章花字": {
        "resource_id": "7407464175347272998",
        "effect_id": "7407464175347272998",
        "name": "红色印章花字",
        "is_vip": True
    },
    "五一立体": {
        "resource_id": "7493107948286250302",
        "effect_id": "7493107948286250302",
        "name": "五一立体",
        "is_vip": True
    },
    "淡黄色渐变发光花字": {
        "resource_id": "7371414308770647346",
        "effect_id": "7371414308770647346",
        "name": "淡黄色渐变发光花字",
        "is_vip": True
    },
    "白色方底拼贴花字": {
        "resource_id": "7405931282632412442",
        "effect_id": "7405931282632412442",
        "name": "白色方底拼贴花字",
        "is_vip": True
    },
    "红金立体国风花字": {
        "resource_id": "7548337425781935422",
        "effect_id": "7548337425781935422",
        "name": "红金立体国风花字",
        "is_vip": True
    },
    "暗黑金泼墨风花字": {
        "resource_id": "7405492993878281510",
        "effect_id": "7405492993878281510",
        "name": "暗黑金泼墨风花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7545366362924043582",
        "effect_id": "7545366362924043582",
        "name": "花字",
        "is_vip": True
    },
    "红色描边花字": {
        "resource_id": "7442261279013604644",
        "effect_id": "7442261279013604644",
        "name": "红色描边花字",
        "is_vip": True
    },
    "金色渐变立体花字": {
        "resource_id": "7506868020917226777",
        "effect_id": "7506868020917226777",
        "name": "金色渐变立体花字",
        "is_vip": True
    },
    "橙色立体花字": {
        "resource_id": "7405152529522101531",
        "effect_id": "7405152529522101531",
        "name": "橙色立体花字",
        "is_vip": True
    },
    "红色锈迹文字": {
        "resource_id": "7412523765768178944",
        "effect_id": "7412523765768178944",
        "name": "红色锈迹文字",
        "is_vip": True
    },
    "紫色渐变": {
        "resource_id": "7398455661513674035",
        "effect_id": "7398455661513674035",
        "name": "紫色渐变",
        "is_vip": True
    },
    "黄色": {
        "resource_id": "7398454655505763593",
        "effect_id": "7398454655505763593",
        "name": "黄色",
        "is_vip": True
    },
    "黑色渐变白蓝描边": {
        "resource_id": "7406687421921791282",
        "effect_id": "7406687421921791282",
        "name": "黑色渐变白蓝描边",
        "is_vip": True
    },
    "端午61立体字效": {
        "resource_id": "7506872589642665240",
        "effect_id": "7506872589642665240",
        "name": "端午61立体字效",
        "is_vip": True
    },
    "黄色立体文字": {
        "resource_id": "7405120470477065507",
        "effect_id": "7405120470477065507",
        "name": "黄色立体文字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7431452163181792524",
        "effect_id": "7431452163181792524",
        "name": "花字",
        "is_vip": True
    },
    "炫彩模糊花字": {
        "resource_id": "7236984607575461154",
        "effect_id": "7236984607575461154",
        "name": "炫彩模糊花字",
        "is_vip": True
    },
    "五四青年立体": {
        "resource_id": "7494656119529393470",
        "effect_id": "7494656119529393470",
        "name": "五四青年立体",
        "is_vip": True
    },
    "复古方底立体": {
        "resource_id": "7406389812925680933",
        "effect_id": "7406389812925680933",
        "name": "复古方底立体",
        "is_vip": True
    },
    "喜庆花字": {
        "resource_id": "7467033569848839486",
        "effect_id": "7467033569848839486",
        "name": "喜庆花字",
        "is_vip": True
    },
    "中秋黄白立体字效": {
        "resource_id": "7546585357555649816",
        "effect_id": "7546585357555649816",
        "name": "中秋黄白立体字效",
        "is_vip": True
    },
    "黄蓝色立体综艺描边花字": {
        "resource_id": "7403927160563551528",
        "effect_id": "7403927160563551528",
        "name": "黄蓝色立体综艺描边花字",
        "is_vip": True
    },
    "白紫色立体花字": {
        "resource_id": "7405229843220106534",
        "effect_id": "7405229843220106534",
        "name": "白紫色立体花字",
        "is_vip": True
    },
    "金色渐变立体发光花字": {
        "resource_id": "7372363920864005386",
        "effect_id": "7372363920864005386",
        "name": "金色渐变立体发光花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7547731905500794174",
        "effect_id": "7547731905500794174",
        "name": "花字",
        "is_vip": True
    },
    "蓝色描边立体花字": {
        "resource_id": "7471910410766109977",
        "effect_id": "7471910410766109977",
        "name": "蓝色描边立体花字",
        "is_vip": True
    },
    "黄色白色": {
        "resource_id": "7505771535878098200",
        "effect_id": "7505771535878098200",
        "name": "黄色白色",
        "is_vip": True
    },
    "渐变色白边立体花字": {
        "resource_id": "7406364344176414003",
        "effect_id": "7406364344176414003",
        "name": "渐变色白边立体花字",
        "is_vip": True
    },
    "橘猫花字": {
        "resource_id": "7403728040653573387",
        "effect_id": "7403728040653573387",
        "name": "橘猫花字",
        "is_vip": True
    },
    "综艺字立体": {
        "resource_id": "7409333268195101979",
        "effect_id": "7409333268195101979",
        "name": "综艺字立体",
        "is_vip": True
    },
    "红橘新年花字": {
        "resource_id": "7455529495043525950",
        "effect_id": "7455529495043525950",
        "name": "红橘新年花字",
        "is_vip": True
    },
    "红包花字": {
        "resource_id": "7449034603760749839",
        "effect_id": "7449034603760749839",
        "name": "红包花字",
        "is_vip": True
    },
    "花字 经典黄色加深蓝经典配色凸显文字": {
        "resource_id": "7231489008126266679",
        "effect_id": "7231489008126266679",
        "name": "花字 经典黄色加深蓝经典配色凸显文字",
        "is_vip": True
    },
    "橙色花字": {
        "resource_id": "7519880279205448984",
        "effect_id": "7519880279205448984",
        "name": "橙色花字",
        "is_vip": True
    },
    "淡蓝色渐变发光花字": {
        "resource_id": "7371415414817000754",
        "effect_id": "7371415414817000754",
        "name": "淡蓝色渐变发光花字",
        "is_vip": True
    },
    "紫色双层描边花字": {
        "resource_id": "7406385391265156362",
        "effect_id": "7406385391265156362",
        "name": "紫色双层描边花字",
        "is_vip": True
    },
    "新年红金花字": {
        "resource_id": "7455254263888104766",
        "effect_id": "7455254263888104766",
        "name": "新年红金花字",
        "is_vip": True
    },
    "晕染蓝": {
        "resource_id": "7357027100324367627",
        "effect_id": "7357027100324367627",
        "name": "晕染蓝",
        "is_vip": True
    },
    "黑色渐变立体花字": {
        "resource_id": "7431440010152316169",
        "effect_id": "7431440010152316169",
        "name": "黑色渐变立体花字",
        "is_vip": True
    },
    "拼贴绿": {
        "resource_id": "7360540744035142953",
        "effect_id": "7360540744035142953",
        "name": "拼贴绿",
        "is_vip": True
    },
    "橘黄色波点渐变发光花字": {
        "resource_id": "7404370982238014747",
        "effect_id": "7404370982238014747",
        "name": "橘黄色波点渐变发光花字",
        "is_vip": True
    },
    "红黄白多层渐变立体花字": {
        "resource_id": "7403764204420730122",
        "effect_id": "7403764204420730122",
        "name": "红黄白多层渐变立体花字",
        "is_vip": True
    },
    "蓝色渐变": {
        "resource_id": "7364604452323495204",
        "effect_id": "7364604452323495204",
        "name": "蓝色渐变",
        "is_vip": True
    },
    "黄绿高饱和多重描边字": {
        "resource_id": "7404415905066782004",
        "effect_id": "7404415905066782004",
        "name": "黄绿高饱和多重描边字",
        "is_vip": True
    },
    "粉色发光花字": {
        "resource_id": "7400335293565455679",
        "effect_id": "7400335293565455679",
        "name": "粉色发光花字",
        "is_vip": True
    },
    "简约雪纹理立体花字": {
        "resource_id": "7430397468082228543",
        "effect_id": "7430397468082228543",
        "name": "简约雪纹理立体花字",
        "is_vip": True
    },
    "白字红边重影风格花字": {
        "resource_id": "7450496790354234674",
        "effect_id": "7450496790354234674",
        "name": "白字红边重影风格花字",
        "is_vip": True
    },
    "蓝色渐变": {
        "resource_id": "7385227292521418018",
        "effect_id": "7385227292521418018",
        "name": "蓝色渐变",
        "is_vip": True
    },
    "粉蓝色渐变立体发光花字": {
        "resource_id": "7366060581410901286",
        "effect_id": "7366060581410901286",
        "name": "粉蓝色渐变立体发光花字",
        "is_vip": True
    },
    "黄色奶酪字": {
        "resource_id": "7405831511003417871",
        "effect_id": "7405831511003417871",
        "name": "黄色奶酪字",
        "is_vip": True
    },
    "彩虹色描边白字": {
        "resource_id": "7406673678412418354",
        "effect_id": "7406673678412418354",
        "name": "彩虹色描边白字",
        "is_vip": True
    },
    "橙黄色渐变立体花字": {
        "resource_id": "7406360821216988416",
        "effect_id": "7406360821216988416",
        "name": "橙黄色渐变立体花字",
        "is_vip": True
    },
    "蓝色纸张质感黄底花字": {
        "resource_id": "7430856547934211379",
        "effect_id": "7430856547934211379",
        "name": "蓝色纸张质感黄底花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7533174868930645273",
        "effect_id": "7533174868930645273",
        "name": "花字",
        "is_vip": True
    },
    "粉色爱心立体字": {
        "resource_id": "7474476846223101209",
        "effect_id": "7474476846223101209",
        "name": "粉色爱心立体字",
        "is_vip": True
    },
    "蓝色纹理立体描边花字": {
        "resource_id": "7406335734044577035",
        "effect_id": "7406335734044577035",
        "name": "蓝色纹理立体描边花字",
        "is_vip": True
    },
    "拼贴浅红": {
        "resource_id": "7360960769703398695",
        "effect_id": "7360960769703398695",
        "name": "拼贴浅红",
        "is_vip": True
    },
    "红色花字 ": {
        "resource_id": "7359358208286215464",
        "effect_id": "7359358208286215464",
        "name": "红色花字 ",
        "is_vip": True
    },
    "故障字": {
        "resource_id": "7347989608908606783",
        "effect_id": "7347989608908606783",
        "name": "故障字",
        "is_vip": True
    },
    "橙色秋叶立体花字": {
        "resource_id": "7538998611628084542",
        "effect_id": "7538998611628084542",
        "name": "橙色秋叶立体花字",
        "is_vip": True
    },
    "国庆黄红立体字效": {
        "resource_id": "7546423084874599705",
        "effect_id": "7546423084874599705",
        "name": "国庆黄红立体字效",
        "is_vip": True
    },
    "黄红渐变纹理花字": {
        "resource_id": "7548711671317974334",
        "effect_id": "7548711671317974334",
        "name": "黄红渐变纹理花字",
        "is_vip": True
    },
    "黄橙玻璃质感秋日花字": {
        "resource_id": "7538711238725946649",
        "effect_id": "7538711238725946649",
        "name": "黄橙玻璃质感秋日花字",
        "is_vip": True
    },
    "复古黄色方底背景": {
        "resource_id": "7406380674057358642",
        "effect_id": "7406380674057358642",
        "name": "复古黄色方底背景",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7539626317688425753",
        "effect_id": "7539626317688425753",
        "name": "花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7548813025013419289",
        "effect_id": "7548813025013419289",
        "name": "花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7540868241737141529",
        "effect_id": "7540868241737141529",
        "name": "花字",
        "is_vip": True
    },
    "立体桔黄": {
        "resource_id": "7546349045032439102",
        "effect_id": "7546349045032439102",
        "name": "立体桔黄",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7538719944897236286",
        "effect_id": "7538719944897236286",
        "name": "花字",
        "is_vip": True
    },
    "618黑边": {
        "resource_id": "7509793945480613144",
        "effect_id": "7509793945480613144",
        "name": "618黑边",
        "is_vip": True
    },
    "综艺风红色立体描边花字": {
        "resource_id": "7508042807811280190",
        "effect_id": "7508042807811280190",
        "name": "综艺风红色立体描边花字",
        "is_vip": True
    },
    "高考立体": {
        "resource_id": "7509930498681163032",
        "effect_id": "7509930498681163032",
        "name": "高考立体",
        "is_vip": True
    },
    "糖炒栗子": {
        "resource_id": "7545871911138577726",
        "effect_id": "7545871911138577726",
        "name": "糖炒栗子",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7540131523937357118",
        "effect_id": "7540131523937357118",
        "name": "花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7546127896943840536",
        "effect_id": "7546127896943840536",
        "name": "花字",
        "is_vip": True
    },
    "斜纹花字": {
        "resource_id": "7546131418620071192",
        "effect_id": "7546131418620071192",
        "name": "斜纹花字",
        "is_vip": True
    },
    "黄色渐变蓝色描边立体花字": {
        "resource_id": "7507853100984667416",
        "effect_id": "7507853100984667416",
        "name": "黄色渐变蓝色描边立体花字",
        "is_vip": True
    },
    "三原色": {
        "resource_id": "7527398816782454040",
        "effect_id": "7527398816782454040",
        "name": "三原色",
        "is_vip": True
    },
    "糖炒栗子": {
        "resource_id": "7546032665510841662",
        "effect_id": "7546032665510841662",
        "name": "糖炒栗子",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7544777148205190425",
        "effect_id": "7544777148205190425",
        "name": "花字",
        "is_vip": True
    },
    "黄色纹理蓝棕色阴影描边立体花字": {
        "resource_id": "7511339634761420057",
        "effect_id": "7511339634761420057",
        "name": "黄色纹理蓝棕色阴影描边立体花字",
        "is_vip": True
    },
    "橙色渐变立体花字": {
        "resource_id": "7533092158820142360",
        "effect_id": "7533092158820142360",
        "name": "橙色渐变立体花字",
        "is_vip": True
    },
    "立体花字": {
        "resource_id": "7532701961364278553",
        "effect_id": "7532701961364278553",
        "name": "立体花字",
        "is_vip": True
    },
    "毛绒字": {
        "resource_id": "7535694140227456280",
        "effect_id": "7535694140227456280",
        "name": "毛绒字",
        "is_vip": True
    },
    "我的潮流指南": {
        "resource_id": "7506898516468370750",
        "effect_id": "7506898516468370750",
        "name": "我的潮流指南",
        "is_vip": True
    },
    "蓝莓奶酪": {
        "resource_id": "7507101495339568446",
        "effect_id": "7507101495339568446",
        "name": "蓝莓奶酪",
        "is_vip": True
    },
    "综艺风蓝色立体描边花字": {
        "resource_id": "7495312625169911065",
        "effect_id": "7495312625169911065",
        "name": "综艺风蓝色立体描边花字",
        "is_vip": True
    },
    "彩铅渐变黄色花字": {
        "resource_id": "7477620313522703678",
        "effect_id": "7477620313522703678",
        "name": "彩铅渐变黄色花字",
        "is_vip": True
    },
    "彩色": {
        "resource_id": "7474582555853901080",
        "effect_id": "7474582555853901080",
        "name": "彩色",
        "is_vip": True
    },
    "膨胀感字": {
        "resource_id": "7480089681586130238",
        "effect_id": "7480089681586130238",
        "name": "膨胀感字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7492216396290542873",
        "effect_id": "7492216396290542873",
        "name": "花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7507526398710435097",
        "effect_id": "7507526398710435097",
        "name": "花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7482733632910675262",
        "effect_id": "7482733632910675262",
        "name": "花字",
        "is_vip": True
    },
    "蓝紫色混合花字": {
        "resource_id": "7236599551984028939",
        "effect_id": "7236599551984028939",
        "name": "蓝紫色混合花字",
        "is_vip": True
    },
    "蓝色": {
        "resource_id": "7481665617796369689",
        "effect_id": "7481665617796369689",
        "name": "蓝色",
        "is_vip": True
    },
    "彩铅渐变粉色花字": {
        "resource_id": "7477756249665342744",
        "effect_id": "7477756249665342744",
        "name": "彩铅渐变粉色花字",
        "is_vip": True
    },
    "渐变花字": {
        "resource_id": "7260020603044826427",
        "effect_id": "7260020603044826427",
        "name": "渐变花字",
        "is_vip": True
    },
    "绿色花字发光": {
        "resource_id": "7506874577159572755",
        "effect_id": "7506874577159572755",
        "name": "绿色花字发光",
        "is_vip": True
    },
    "可爱彩色涂鸦花字": {
        "resource_id": "7350563191123938611",
        "effect_id": "7350563191123938611",
        "name": "可爱彩色涂鸦花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7508005459065097497",
        "effect_id": "7508005459065097497",
        "name": "花字",
        "is_vip": True
    },
    "粉色闪闪芭比花字": {
        "resource_id": "7507082793592032536",
        "effect_id": "7507082793592032536",
        "name": "粉色闪闪芭比花字",
        "is_vip": True
    },
    "粉色渐变": {
        "resource_id": "7469677410414382398",
        "effect_id": "7469677410414382398",
        "name": "粉色渐变",
        "is_vip": True
    },
    "马卡龙": {
        "resource_id": "7509757725908225304",
        "effect_id": "7509757725908225304",
        "name": "马卡龙",
        "is_vip": True
    },
    "发光字": {
        "resource_id": "7348369625215749388",
        "effect_id": "7348369625215749388",
        "name": "发光字",
        "is_vip": True
    },
    "粉笔字": {
        "resource_id": "7403964791372533027",
        "effect_id": "7403964791372533027",
        "name": "粉笔字",
        "is_vip": True
    },
    "蓝白": {
        "resource_id": "7508363172798270744",
        "effect_id": "7508363172798270744",
        "name": "蓝白",
        "is_vip": True
    },
    "黄绿渐变立体字": {
        "resource_id": "7477149973520583961",
        "effect_id": "7477149973520583961",
        "name": "黄绿渐变立体字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7495692617561181502",
        "effect_id": "7495692617561181502",
        "name": "花字",
        "is_vip": True
    },
    "多层描边彩色多巴胺花字": {
        "resource_id": "7494493486155042110",
        "effect_id": "7494493486155042110",
        "name": "多层描边彩色多巴胺花字",
        "is_vip": True
    },
    "蓝粉": {
        "resource_id": "7492310644704841022",
        "effect_id": "7492310644704841022",
        "name": "蓝粉",
        "is_vip": True
    },
    "节日绿色立体描边花字": {
        "resource_id": "7507164704448679193",
        "effect_id": "7507164704448679193",
        "name": "节日绿色立体描边花字",
        "is_vip": True
    },
    "蓝绿色花字": {
        "resource_id": "7347171058488823066",
        "effect_id": "7347171058488823066",
        "name": "蓝绿色花字",
        "is_vip": True
    },
    "粉色立体拼贴花字": {
        "resource_id": "7405934415567736074",
        "effect_id": "7405934415567736074",
        "name": "粉色立体拼贴花字",
        "is_vip": True
    },
    "彩色描边立体可爱花字": {
        "resource_id": "7492411773329476889",
        "effect_id": "7492411773329476889",
        "name": "彩色描边立体可爱花字",
        "is_vip": True
    },
    "绿色立体": {
        "resource_id": "7492716248091004222",
        "effect_id": "7492716248091004222",
        "name": "绿色立体",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7471905506001669401",
        "effect_id": "7471905506001669401",
        "name": "花字",
        "is_vip": True
    },
    "春日综艺感渐变纹理花字": {
        "resource_id": "7479683834464898329",
        "effect_id": "7479683834464898329",
        "name": "春日综艺感渐变纹理花字",
        "is_vip": True
    },
    "绿紫黄紫立体字": {
        "resource_id": "7478608447794187582",
        "effect_id": "7478608447794187582",
        "name": "绿紫黄紫立体字",
        "is_vip": True
    },
    "膨胀感字": {
        "resource_id": "7480097920361073945",
        "effect_id": "7480097920361073945",
        "name": "膨胀感字",
        "is_vip": True
    },
    "立体综艺花字": {
        "resource_id": "7403676308145802522",
        "effect_id": "7403676308145802522",
        "name": "立体综艺花字",
        "is_vip": False
    },
    "白色纹理描边花字": {
        "resource_id": "7405202500493610275",
        "effect_id": "7405202500493610275",
        "name": "白色纹理描边花字",
        "is_vip": False
    },
    "复古淡黄花字": {
        "resource_id": "7441152469352090889",
        "effect_id": "7441152469352090889",
        "name": "复古淡黄花字",
        "is_vip": False
    },
    "白色发光字": {
        "resource_id": "7405564299122429219",
        "effect_id": "7405564299122429219",
        "name": "白色发光字",
        "is_vip": False
    },
    "黄色渐变立体白描边花字": {
        "resource_id": "7403679510702378278",
        "effect_id": "7403679510702378278",
        "name": "黄色渐变立体白描边花字",
        "is_vip": False
    },
    "白字红边立体字": {
        "resource_id": "7403960732490157364",
        "effect_id": "7403960732490157364",
        "name": "白字红边立体字",
        "is_vip": False
    },
    "蓝色立体字": {
        "resource_id": "7405107629137186082",
        "effect_id": "7405107629137186082",
        "name": "蓝色立体字",
        "is_vip": False
    },
    "美拉德立体文字": {
        "resource_id": "7410649194110733602",
        "effect_id": "7410649194110733602",
        "name": "美拉德立体文字",
        "is_vip": False
    },
    "绿色立体通用花字": {
        "resource_id": "7404477237837270299",
        "effect_id": "7404477237837270299",
        "name": "绿色立体通用花字",
        "is_vip": False
    },
    "绿色镂空透明文字": {
        "resource_id": "7405105991651544360",
        "effect_id": "7405105991651544360",
        "name": "绿色镂空透明文字",
        "is_vip": False
    },
    "绿色描边投影字": {
        "resource_id": "7405410790867586344",
        "effect_id": "7405410790867586344",
        "name": "绿色描边投影字",
        "is_vip": False
    },
    "绿色透明纹理花字": {
        "resource_id": "7405203773066415360",
        "effect_id": "7405203773066415360",
        "name": "绿色透明纹理花字",
        "is_vip": False
    },
    "综艺火焰": {
        "resource_id": "7543157780769803582",
        "effect_id": "7543157780769803582",
        "name": "综艺火焰",
        "is_vip": True
    },
    "系统故障字": {
        "resource_id": "7347967906669415716",
        "effect_id": "7347967906669415716",
        "name": "系统故障字",
        "is_vip": True
    },
    "蓝色黄色渐变立体描边花字": {
        "resource_id": "7532041202787487038",
        "effect_id": "7532041202787487038",
        "name": "蓝色黄色渐变立体描边花字",
        "is_vip": True
    },
    "综艺 黄色": {
        "resource_id": "7127670164996328740",
        "effect_id": "7127670164996328740",
        "name": "综艺 黄色",
        "is_vip": True
    },
    "黑白黄色花字": {
        "resource_id": "7260340249581128996",
        "effect_id": "7260340249581128996",
        "name": "黑白黄色花字",
        "is_vip": True
    },
    "红色火焰燃烧花字": {
        "resource_id": "7405896759987227931",
        "effect_id": "7405896759987227931",
        "name": "红色火焰燃烧花字",
        "is_vip": True
    },
    "复古紫光蓝色渐变立体花字": {
        "resource_id": "7160595602236116232",
        "effect_id": "7160595602236116232",
        "name": "复古紫光蓝色渐变立体花字",
        "is_vip": True
    },
    "综艺风蓝色描边立体花字": {
        "resource_id": "7494932494253608216",
        "effect_id": "7494932494253608216",
        "name": "综艺风蓝色描边立体花字",
        "is_vip": True
    },
    "喷溅红立体": {
        "resource_id": "7411046111760125211",
        "effect_id": "7411046111760125211",
        "name": "喷溅红立体",
        "is_vip": True
    },
    "红黄渐变纹理立体花字": {
        "resource_id": "7313160248175398154",
        "effect_id": "7313160248175398154",
        "name": "红黄渐变纹理立体花字",
        "is_vip": True
    },
    "白字蓝框综艺花字": {
        "resource_id": "7403899942944705819",
        "effect_id": "7403899942944705819",
        "name": "白字蓝框综艺花字",
        "is_vip": True
    },
    "美食-金色渐变": {
        "resource_id": "7205144150390443301",
        "effect_id": "7205144150390443301",
        "name": "美食-金色渐变",
        "is_vip": True
    },
    "红色火焰字": {
        "resource_id": "7406328633205312820",
        "effect_id": "7406328633205312820",
        "name": "红色火焰字",
        "is_vip": True
    },
    "镂空发光字": {
        "resource_id": "7404690754590821632",
        "effect_id": "7404690754590821632",
        "name": "镂空发光字",
        "is_vip": True
    },
    "蓝色纹理花字": {
        "resource_id": "7405902936175381787",
        "effect_id": "7405902936175381787",
        "name": "蓝色纹理花字",
        "is_vip": True
    },
    "白色质感纹理立体花字": {
        "resource_id": "7310113812168871177",
        "effect_id": "7310113812168871177",
        "name": "白色质感纹理立体花字",
        "is_vip": True
    },
    "黄色花字": {
        "resource_id": "7430781079058976026",
        "effect_id": "7430781079058976026",
        "name": "黄色花字",
        "is_vip": True
    },
    "综艺立体": {
        "resource_id": "7448962185159609625",
        "effect_id": "7448962185159609625",
        "name": "综艺立体",
        "is_vip": True
    },
    "五一复古立体": {
        "resource_id": "7494493305716378905",
        "effect_id": "7494493305716378905",
        "name": "五一复古立体",
        "is_vip": True
    },
    "好物美妆-双层投影": {
        "resource_id": "7264501278175202572",
        "effect_id": "7264501278175202572",
        "name": "好物美妆-双层投影",
        "is_vip": True
    },
    "白字绿底花字": {
        "resource_id": "7350578203905232166",
        "effect_id": "7350578203905232166",
        "name": "白字绿底花字",
        "is_vip": True
    },
    "渐变错位花字": {
        "resource_id": "7406249723423640871",
        "effect_id": "7406249723423640871",
        "name": "渐变错位花字",
        "is_vip": True
    },
    "彩色": {
        "resource_id": "7474546033763224894",
        "effect_id": "7474546033763224894",
        "name": "彩色",
        "is_vip": True
    },
    "像素格背景字": {
        "resource_id": "7406866881144966409",
        "effect_id": "7406866881144966409",
        "name": "像素格背景字",
        "is_vip": True
    },
    "橙黄渐变花字": {
        "resource_id": "7404777689518738728",
        "effect_id": "7404777689518738728",
        "name": "橙黄渐变花字",
        "is_vip": True
    },
    "彩色手绘线条花字": {
        "resource_id": "7342020000812731658",
        "effect_id": "7342020000812731658",
        "name": "彩色手绘线条花字",
        "is_vip": True
    },
    "立体麻布花纹字体": {
        "resource_id": "7262979013637967119",
        "effect_id": "7262979013637967119",
        "name": "立体麻布花纹字体",
        "is_vip": True
    },
    "红色渐变波点底纹立体花字": {
        "resource_id": "7406013385969569062",
        "effect_id": "7406013385969569062",
        "name": "红色渐变波点底纹立体花字",
        "is_vip": True
    },
    "综艺风蓝色渐变纹理立体花字": {
        "resource_id": "7478945314318241086",
        "effect_id": "7478945314318241086",
        "name": "综艺风蓝色渐变纹理立体花字",
        "is_vip": True
    },
    "高饱和彩虹字": {
        "resource_id": "7404293089377930536",
        "effect_id": "7404293089377930536",
        "name": "高饱和彩虹字",
        "is_vip": True
    },
    "3D蓝红色立体综艺花字": {
        "resource_id": "7404132140365008179",
        "effect_id": "7404132140365008179",
        "name": "3D蓝红色立体综艺花字",
        "is_vip": True
    },
    "音乐节-杂点黄字": {
        "resource_id": "7272729157895769355",
        "effect_id": "7272729157895769355",
        "name": "音乐节-杂点黄字",
        "is_vip": True
    },
    "拼贴位移字": {
        "resource_id": "7343806780583038247",
        "effect_id": "7343806780583038247",
        "name": "拼贴位移字",
        "is_vip": True
    },
    "彩色立体底框花字": {
        "resource_id": "7347548073897364746",
        "effect_id": "7347548073897364746",
        "name": "彩色立体底框花字",
        "is_vip": True
    },
    "综艺风蓝色立体描边花字": {
        "resource_id": "7495656020006669592",
        "effect_id": "7495656020006669592",
        "name": "综艺风蓝色立体描边花字",
        "is_vip": True
    },
    "黑字底红光": {
        "resource_id": "7230694221513035020",
        "effect_id": "7230694221513035020",
        "name": "黑字底红光",
        "is_vip": True
    },
    "海浪卡通立体字": {
        "resource_id": "7405947244395924770",
        "effect_id": "7405947244395924770",
        "name": "海浪卡通立体字",
        "is_vip": True
    },
    "浪花紫": {
        "resource_id": "7261598257762045219",
        "effect_id": "7261598257762045219",
        "name": "浪花紫",
        "is_vip": True
    },
    "裂纹立体文字": {
        "resource_id": "7405953030996184335",
        "effect_id": "7405953030996184335",
        "name": "裂纹立体文字",
        "is_vip": True
    },
    "漫画层叠花字": {
        "resource_id": "7406307881865301258",
        "effect_id": "7406307881865301258",
        "name": "漫画层叠花字",
        "is_vip": True
    },
    "节点营销直播主题立体字蓝色": {
        "resource_id": "7403686755486010634",
        "effect_id": "7403686755486010634",
        "name": "节点营销直播主题立体字蓝色",
        "is_vip": True
    },
    "黑色立体投影紫色发光镭射纹理花字  艺术字体": {
        "resource_id": "7251715329162841347",
        "effect_id": "7251715329162841347",
        "name": "黑色立体投影紫色发光镭射纹理花字  艺术字体",
        "is_vip": True
    },
    "复古白蓝色立体花字": {
        "resource_id": "7405563025169632562",
        "effect_id": "7405563025169632562",
        "name": "复古白蓝色立体花字",
        "is_vip": True
    },
    "爆款热卖": {
        "resource_id": "7430816571443940659",
        "effect_id": "7430816571443940659",
        "name": "爆款热卖",
        "is_vip": True
    },
    "蓝紫渐变多重投影字": {
        "resource_id": "7403937403397885184",
        "effect_id": "7403937403397885184",
        "name": "蓝紫渐变多重投影字",
        "is_vip": True
    },
    "综艺白色立体描边纹理花字": {
        "resource_id": "7404868077101255988",
        "effect_id": "7404868077101255988",
        "name": "综艺白色立体描边纹理花字",
        "is_vip": True
    },
    "红金渐变国风立体花字": {
        "resource_id": "7547984081930161470",
        "effect_id": "7547984081930161470",
        "name": "红金渐变国风立体花字",
        "is_vip": True
    },
    "立体字粉色背景": {
        "resource_id": "7409964157296020751",
        "effect_id": "7409964157296020751",
        "name": "立体字粉色背景",
        "is_vip": True
    },
    "金色渐变红底立体花字": {
        "resource_id": "7330165240576970021",
        "effect_id": "7330165240576970021",
        "name": "金色渐变红底立体花字",
        "is_vip": True
    },
    "热销字体": {
        "resource_id": "7431487397017226507",
        "effect_id": "7431487397017226507",
        "name": "热销字体",
        "is_vip": True
    },
    "位移字": {
        "resource_id": "7343541738537061651",
        "effect_id": "7343541738537061651",
        "name": "位移字",
        "is_vip": True
    },
    "美食-立体描边": {
        "resource_id": "7205148909730024762",
        "effect_id": "7205148909730024762",
        "name": "美食-立体描边",
        "is_vip": True
    },
    "格子背景双色字": {
        "resource_id": "7404037981952068879",
        "effect_id": "7404037981952068879",
        "name": "格子背景双色字",
        "is_vip": True
    },
    "落日鸡尾酒": {
        "resource_id": "7174051263578000678",
        "effect_id": "7174051263578000678",
        "name": "落日鸡尾酒",
        "is_vip": True
    },
    "春节-半透明": {
        "resource_id": "7187622568717749565",
        "effect_id": "7187622568717749565",
        "name": "春节-半透明",
        "is_vip": True
    },
    "黑色综艺花字": {
        "resource_id": "7241429233287925044",
        "effect_id": "7241429233287925044",
        "name": "黑色综艺花字",
        "is_vip": True
    },
    "白/黄方块图案质感花字": {
        "resource_id": "7405060175322795276",
        "effect_id": "7405060175322795276",
        "name": "白/黄方块图案质感花字",
        "is_vip": True
    },
    "时尚黑蓝粉": {
        "resource_id": "7284906593399950647",
        "effect_id": "7284906593399950647",
        "name": "时尚黑蓝粉",
        "is_vip": True
    },
    "3D蓝色渐变综艺花字": {
        "resource_id": "7403911656587234597",
        "effect_id": "7403911656587234597",
        "name": "3D蓝色渐变综艺花字",
        "is_vip": True
    },
    "白色蓝色描边红色荧光花字": {
        "resource_id": "7241398402125253903",
        "effect_id": "7241398402125253903",
        "name": "白色蓝色描边红色荧光花字",
        "is_vip": True
    },
    "白色仿3D立体花字": {
        "resource_id": "7371129776494365990",
        "effect_id": "7371129776494365990",
        "name": "白色仿3D立体花字",
        "is_vip": True
    },
    "蓝色立体描边花字": {
        "resource_id": "7406357450166635776",
        "effect_id": "7406357450166635776",
        "name": "蓝色立体描边花字",
        "is_vip": True
    },
    "破碎裂开文字": {
        "resource_id": "7404701167156088116",
        "effect_id": "7404701167156088116",
        "name": "破碎裂开文字",
        "is_vip": True
    },
    "黄边黑字立体花字": {
        "resource_id": "7270881305070423356",
        "effect_id": "7270881305070423356",
        "name": "黄边黑字立体花字",
        "is_vip": True
    },
    "立体星星花字": {
        "resource_id": "7405886722011172150",
        "effect_id": "7405886722011172150",
        "name": "立体星星花字",
        "is_vip": True
    },
    "多色花字": {
        "resource_id": "7405917295421263158",
        "effect_id": "7405917295421263158",
        "name": "多色花字",
        "is_vip": True
    },
    "立体方块花字": {
        "resource_id": "7481488244421741848",
        "effect_id": "7481488244421741848",
        "name": "立体方块花字",
        "is_vip": True
    },
    "水墨纹花字": {
        "resource_id": "7252151198805986572",
        "effect_id": "7252151198805986572",
        "name": "水墨纹花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7529442177953352985",
        "effect_id": "7529442177953352985",
        "name": "花字",
        "is_vip": True
    },
    "白字蓝底花字": {
        "resource_id": "7368858909295136010",
        "effect_id": "7368858909295136010",
        "name": "白字蓝底花字",
        "is_vip": True
    },
    "橙色纹理立体发光花字": {
        "resource_id": "7430724518248729919",
        "effect_id": "7430724518248729919",
        "name": "橙色纹理立体发光花字",
        "is_vip": True
    },
    "红黄绿复古花字": {
        "resource_id": "7407014154613116210",
        "effect_id": "7407014154613116210",
        "name": "红黄绿复古花字",
        "is_vip": True
    },
    "橙黄色渐变立体描边花字": {
        "resource_id": "7404037530980453647",
        "effect_id": "7404037530980453647",
        "name": "橙黄色渐变立体描边花字",
        "is_vip": True
    },
    "潮酷薄膜纹理字": {
        "resource_id": "7404380953893735714",
        "effect_id": "7404380953893735714",
        "name": "潮酷薄膜纹理字",
        "is_vip": True
    },
    "粉色贝壳光泽花字": {
        "resource_id": "7265614510084443444",
        "effect_id": "7265614510084443444",
        "name": "粉色贝壳光泽花字",
        "is_vip": True
    },
    "四色蜡笔花字": {
        "resource_id": "7348679900477279507",
        "effect_id": "7348679900477279507",
        "name": "四色蜡笔花字",
        "is_vip": True
    },
    "蓝色立体描边发光花字": {
        "resource_id": "7404828145255288075",
        "effect_id": "7404828145255288075",
        "name": "蓝色立体描边发光花字",
        "is_vip": True
    },
    "限时抢购": {
        "resource_id": "7510183639066627352",
        "effect_id": "7510183639066627352",
        "name": "限时抢购",
        "is_vip": True
    },
    "游戏综艺风蓝色波点渐变花字": {
        "resource_id": "7404883759012597030",
        "effect_id": "7404883759012597030",
        "name": "游戏综艺风蓝色波点渐变花字",
        "is_vip": True
    },
    "紫色梦幻   白字紫底红醒目花字": {
        "resource_id": "7334687695660272947",
        "effect_id": "7334687695660272947",
        "name": "紫色梦幻   白字紫底红醒目花字",
        "is_vip": True
    },
    "蓝色渐变综艺": {
        "resource_id": "7435551949266701580",
        "effect_id": "7435551949266701580",
        "name": "蓝色渐变综艺",
        "is_vip": True
    },
    "黑色粉色阴影花字": {
        "resource_id": "7289732660077874491",
        "effect_id": "7289732660077874491",
        "name": "黑色粉色阴影花字",
        "is_vip": True
    },
    "黑体蓝紫边发光花字": {
        "resource_id": "7259399609452088637",
        "effect_id": "7259399609452088637",
        "name": "黑体蓝紫边发光花字",
        "is_vip": True
    },
    "粉笔涂鸦花字（教师节）": {
        "resource_id": "7405546666498985227",
        "effect_id": "7405546666498985227",
        "name": "粉笔涂鸦花字（教师节）",
        "is_vip": True
    },
    "可爱花字": {
        "resource_id": "7430667612146666764",
        "effect_id": "7430667612146666764",
        "name": "可爱花字",
        "is_vip": True
    },
    "黑粉甜酷拼贴文字": {
        "resource_id": "7431814893415812362",
        "effect_id": "7431814893415812362",
        "name": "黑粉甜酷拼贴文字",
        "is_vip": True
    },
    "彩色立体": {
        "resource_id": "7506818824885390616",
        "effect_id": "7506818824885390616",
        "name": "彩色立体",
        "is_vip": True
    },
    "浅棕色描边花字": {
        "resource_id": "7328771445960592640",
        "effect_id": "7328771445960592640",
        "name": "浅棕色描边花字",
        "is_vip": True
    },
    "蓝红蜡笔质感纹理花字": {
        "resource_id": "7543482227871599896",
        "effect_id": "7543482227871599896",
        "name": "蓝红蜡笔质感纹理花字",
        "is_vip": True
    },
    "黄色渐变": {
        "resource_id": "7410369831503006988",
        "effect_id": "7410369831503006988",
        "name": "黄色渐变",
        "is_vip": True
    },
    "综艺风方块背景立体花字": {
        "resource_id": "7404072480870026534",
        "effect_id": "7404072480870026534",
        "name": "综艺风方块背景立体花字",
        "is_vip": True
    },
    "彩色花字": {
        "resource_id": "7252116303329217824",
        "effect_id": "7252116303329217824",
        "name": "彩色花字",
        "is_vip": True
    },
    "综艺感蓝色立体描边花字": {
        "resource_id": "7482027387266469145",
        "effect_id": "7482027387266469145",
        "name": "综艺感蓝色立体描边花字",
        "is_vip": True
    },
    "彩色透明花字": {
        "resource_id": "7406321401969364264",
        "effect_id": "7406321401969364264",
        "name": "彩色透明花字",
        "is_vip": True
    },
    "橙色蓝色花字": {
        "resource_id": "7369415539795529012",
        "effect_id": "7369415539795529012",
        "name": "橙色蓝色花字",
        "is_vip": True
    },
    "黑字黄绿拼贴花字": {
        "resource_id": "7406010573961317670",
        "effect_id": "7406010573961317670",
        "name": "黑字黄绿拼贴花字",
        "is_vip": True
    },
    "蓝橙白立体花字": {
        "resource_id": "7504864758944927001",
        "effect_id": "7504864758944927001",
        "name": "蓝橙白立体花字",
        "is_vip": True
    },
    "黄蓝撞色描边字": {
        "resource_id": "7435272797611429172",
        "effect_id": "7435272797611429172",
        "name": "黄蓝撞色描边字",
        "is_vip": True
    },
    "玫粉黑花字": {
        "resource_id": "7407015583444782375",
        "effect_id": "7407015583444782375",
        "name": "玫粉黑花字",
        "is_vip": True
    },
    "芭比粉背景白字": {
        "resource_id": "7405183112906378522",
        "effect_id": "7405183112906378522",
        "name": "芭比粉背景白字",
        "is_vip": True
    },
    "万圣节多色花字": {
        "resource_id": "7407047445240139071",
        "effect_id": "7407047445240139071",
        "name": "万圣节多色花字",
        "is_vip": True
    },
    "复古风花字": {
        "resource_id": "7406318872862674185",
        "effect_id": "7406318872862674185",
        "name": "复古风花字",
        "is_vip": True
    },
    "深红白边黄影立体花字": {
        "resource_id": "7231502419723603239",
        "effect_id": "7231502419723603239",
        "name": "深红白边黄影立体花字",
        "is_vip": True
    },
    "APT花字": {
        "resource_id": "7431429796434890021",
        "effect_id": "7431429796434890021",
        "name": "APT花字",
        "is_vip": True
    },
    "粉底黄边黑色立体花字": {
        "resource_id": "7270171712136776997",
        "effect_id": "7270171712136776997",
        "name": "粉底黄边黑色立体花字",
        "is_vip": True
    },
    "未来科技感立体厚重标题花字": {
        "resource_id": "7405789476561095986",
        "effect_id": "7405789476561095986",
        "name": "未来科技感立体厚重标题花字",
        "is_vip": True
    },
    "白字带描边花字": {
        "resource_id": "7405944078992559411",
        "effect_id": "7405944078992559411",
        "name": "白字带描边花字",
        "is_vip": True
    },
    "美妆方底": {
        "resource_id": "7411583332707863835",
        "effect_id": "7411583332707863835",
        "name": "美妆方底",
        "is_vip": True
    },
    "酒红风格   黄字酒红底色花字": {
        "resource_id": "7337839774079798566",
        "effect_id": "7337839774079798566",
        "name": "酒红风格   黄字酒红底色花字",
        "is_vip": True
    },
    "多色花字": {
        "resource_id": "7406589254157061439",
        "effect_id": "7406589254157061439",
        "name": "多色花字",
        "is_vip": True
    },
    "黄绿撕纸拼贴质感花字": {
        "resource_id": "7405065396648283455",
        "effect_id": "7405065396648283455",
        "name": "黄绿撕纸拼贴质感花字",
        "is_vip": True
    },
    "橙黄色立体霓虹花字": {
        "resource_id": "7405186414284999971",
        "effect_id": "7405186414284999971",
        "name": "橙黄色立体霓虹花字",
        "is_vip": True
    },
    "黄色渐变粉色花朵底纹立体花字": {
        "resource_id": "7544660134732057881",
        "effect_id": "7544660134732057881",
        "name": "黄色渐变粉色花朵底纹立体花字",
        "is_vip": True
    },
    "青团底纹花字": {
        "resource_id": "7348639844198878515",
        "effect_id": "7348639844198878515",
        "name": "青团底纹花字",
        "is_vip": True
    },
    "黄蓝渐变立体字": {
        "resource_id": "7382058294157774107",
        "effect_id": "7382058294157774107",
        "name": "黄蓝渐变立体字",
        "is_vip": True
    },
    "紫色描边发光小字体": {
        "resource_id": "7252346023656394042",
        "effect_id": "7252346023656394042",
        "name": "紫色描边发光小字体",
        "is_vip": True
    },
    "粉蓝色渐变黑边立体花字": {
        "resource_id": "7404290790391860530",
        "effect_id": "7404290790391860530",
        "name": "粉蓝色渐变黑边立体花字",
        "is_vip": True
    },
    "红色渐变黄绿描边": {
        "resource_id": "7406979682911931657",
        "effect_id": "7406979682911931657",
        "name": "红色渐变黄绿描边",
        "is_vip": True
    },
    "美妆拼贴": {
        "resource_id": "7411563961381817610",
        "effect_id": "7411563961381817610",
        "name": "美妆拼贴",
        "is_vip": True
    },
    "游戏综艺风黄红紫渐变花字": {
        "resource_id": "7404883418774818086",
        "effect_id": "7404883418774818086",
        "name": "游戏综艺风黄红紫渐变花字",
        "is_vip": True
    },
    "彩色花字": {
        "resource_id": "7430759634757061926",
        "effect_id": "7430759634757061926",
        "name": "彩色花字",
        "is_vip": True
    },
    "蓝橙波点纹理玻璃质感立体花字": {
        "resource_id": "7543299507744967960",
        "effect_id": "7543299507744967960",
        "name": "蓝橙波点纹理玻璃质感立体花字",
        "is_vip": True
    },
    "蓝色纹理立体花字": {
        "resource_id": "7406011366865161481",
        "effect_id": "7406011366865161481",
        "name": "蓝色纹理立体花字",
        "is_vip": True
    },
    "放射背景字": {
        "resource_id": "7404009350399937792",
        "effect_id": "7404009350399937792",
        "name": "放射背景字",
        "is_vip": True
    },
    "白字黄绿拼贴花字": {
        "resource_id": "7406011150829194546",
        "effect_id": "7406011150829194546",
        "name": "白字黄绿拼贴花字",
        "is_vip": True
    },
    "夏日蓝描边立体": {
        "resource_id": "7548102481977593113",
        "effect_id": "7548102481977593113",
        "name": "夏日蓝描边立体",
        "is_vip": True
    },
    "白色国风水墨花字": {
        "resource_id": "7405537186436648201",
        "effect_id": "7405537186436648201",
        "name": "白色国风水墨花字",
        "is_vip": True
    },
    "金箔纹理阴影花字": {
        "resource_id": "7405530102324415807",
        "effect_id": "7405530102324415807",
        "name": "金箔纹理阴影花字",
        "is_vip": True
    },
    "书法墨迹白色花字": {
        "resource_id": "7405519026367122727",
        "effect_id": "7405519026367122727",
        "name": "书法墨迹白色花字",
        "is_vip": True
    },
    "泼墨书法纹理花字": {
        "resource_id": "7405512855434382611",
        "effect_id": "7405512855434382611",
        "name": "泼墨书法纹理花字",
        "is_vip": True
    },
    "红色斑驳": {
        "resource_id": "7475566213477977368",
        "effect_id": "7475566213477977368",
        "name": "红色斑驳",
        "is_vip": True
    },
    "红色立体": {
        "resource_id": "7546579616576720152",
        "effect_id": "7546579616576720152",
        "name": "红色立体",
        "is_vip": True
    },
    "金色质感立体花字": {
        "resource_id": "7405499580399357210",
        "effect_id": "7405499580399357210",
        "name": "金色质感立体花字",
        "is_vip": True
    },
    "国风花字": {
        "resource_id": "7406643508242582825",
        "effect_id": "7406643508242582825",
        "name": "国风花字",
        "is_vip": True
    },
    "黑白水墨字": {
        "resource_id": "7405516433863511348",
        "effect_id": "7405516433863511348",
        "name": "黑白水墨字",
        "is_vip": True
    },
    "复古红色立体花字": {
        "resource_id": "7435884430620691739",
        "effect_id": "7435884430620691739",
        "name": "复古红色立体花字",
        "is_vip": True
    },
    "国风花字": {
        "resource_id": "7406646658768882983",
        "effect_id": "7406646658768882983",
        "name": "国风花字",
        "is_vip": True
    },
    "水墨风晕染花字": {
        "resource_id": "7405497799036407090",
        "effect_id": "7405497799036407090",
        "name": "水墨风晕染花字",
        "is_vip": True
    },
    "白金花字": {
        "resource_id": "7405510219633036555",
        "effect_id": "7405510219633036555",
        "name": "白金花字",
        "is_vip": True
    },
    "古风质感花字": {
        "resource_id": "7483351934074817817",
        "effect_id": "7483351934074817817",
        "name": "古风质感花字",
        "is_vip": True
    },
    "暗黑系红色火焰纹理花字": {
        "resource_id": "7405504415408409865",
        "effect_id": "7405504415408409865",
        "name": "暗黑系红色火焰纹理花字",
        "is_vip": True
    },
    "红金国风花字": {
        "resource_id": "7405500731253411108",
        "effect_id": "7405500731253411108",
        "name": "红金国风花字",
        "is_vip": True
    },
    "点墨金银花字": {
        "resource_id": "7405517111231073575",
        "effect_id": "7405517111231073575",
        "name": "点墨金银花字",
        "is_vip": True
    },
    "春节新年福字背景花字": {
        "resource_id": "7404078955344448777",
        "effect_id": "7404078955344448777",
        "name": "春节新年福字背景花字",
        "is_vip": True
    },
    "银色花字": {
        "resource_id": "7405512551879970067",
        "effect_id": "7405512551879970067",
        "name": "银色花字",
        "is_vip": True
    },
    "红色暗黑花字": {
        "resource_id": "7405501851887586611",
        "effect_id": "7405501851887586611",
        "name": "红色暗黑花字",
        "is_vip": True
    },
    "国风花字": {
        "resource_id": "7406643758231571766",
        "effect_id": "7406643758231571766",
        "name": "国风花字",
        "is_vip": True
    },
    "黑红渐变立体描边花字": {
        "resource_id": "7405506413524569363",
        "effect_id": "7405506413524569363",
        "name": "黑红渐变立体描边花字",
        "is_vip": True
    },
    "书法水痕阴影花字": {
        "resource_id": "7405527291209469196",
        "effect_id": "7405527291209469196",
        "name": "书法水痕阴影花字",
        "is_vip": True
    },
    "水墨背景白色花字": {
        "resource_id": "7405534702221790515",
        "effect_id": "7405534702221790515",
        "name": "水墨背景白色花字",
        "is_vip": True
    },
    "国风金红花字": {
        "resource_id": "7405499186109533494",
        "effect_id": "7405499186109533494",
        "name": "国风金红花字",
        "is_vip": True
    },
    "红金国风花字": {
        "resource_id": "7507132514088062233",
        "effect_id": "7507132514088062233",
        "name": "红金国风花字",
        "is_vip": True
    },
    "黑白水墨花字": {
        "resource_id": "7405498270568418611",
        "effect_id": "7405498270568418611",
        "name": "黑白水墨花字",
        "is_vip": True
    },
    "暗黑红色立体花字": {
        "resource_id": "7405503477444644106",
        "effect_id": "7405503477444644106",
        "name": "暗黑红色立体花字",
        "is_vip": True
    },
    "暗黑墨迹字": {
        "resource_id": "7405513478645091636",
        "effect_id": "7405513478645091636",
        "name": "暗黑墨迹字",
        "is_vip": True
    },
    "青绿色水墨风古典边框花字": {
        "resource_id": "7405879747340700937",
        "effect_id": "7405879747340700937",
        "name": "青绿色水墨风古典边框花字",
        "is_vip": True
    },
    "水墨书法纹理花字": {
        "resource_id": "7405514792724745484",
        "effect_id": "7405514792724745484",
        "name": "水墨书法纹理花字",
        "is_vip": True
    },
    "黑灰色质感立体花字": {
        "resource_id": "7405500890620120358",
        "effect_id": "7405500890620120358",
        "name": "黑灰色质感立体花字",
        "is_vip": True
    },
    "暗黑火焰红边花字": {
        "resource_id": "7405494488019275059",
        "effect_id": "7405494488019275059",
        "name": "暗黑火焰红边花字",
        "is_vip": True
    },
    "暗红色墨痕书法花字": {
        "resource_id": "7405528972135583030",
        "effect_id": "7405528972135583030",
        "name": "暗红色墨痕书法花字",
        "is_vip": True
    },
    "银色国风花字": {
        "resource_id": "7405504097429867815",
        "effect_id": "7405504097429867815",
        "name": "银色国风花字",
        "is_vip": True
    },
    "书法墨环图案花字": {
        "resource_id": "7405524745959034124",
        "effect_id": "7405524745959034124",
        "name": "书法墨环图案花字",
        "is_vip": False
    },
    "金箔描边书法水墨花字": {
        "resource_id": "7405523665145613631",
        "effect_id": "7405523665145613631",
        "name": "金箔描边书法水墨花字",
        "is_vip": False
    },
    "综艺金色花字": {
        "resource_id": "7127823728267791647",
        "effect_id": "7127823728267791647",
        "name": "综艺金色花字",
        "is_vip": True
    },
    "潮酷发光立体花字": {
        "resource_id": "7160598356237012261",
        "effect_id": "7160598356237012261",
        "name": "潮酷发光立体花字",
        "is_vip": True
    },
    "潮酷金色发光花字": {
        "resource_id": "7160595759375666446",
        "effect_id": "7160595759375666446",
        "name": "潮酷金色发光花字",
        "is_vip": True
    },
    "光芒万丈": {
        "resource_id": "7269602984844102947",
        "effect_id": "7269602984844102947",
        "name": "光芒万丈",
        "is_vip": True
    },
    "综艺立体花字": {
        "resource_id": "7160596923781598472",
        "effect_id": "7160596923781598472",
        "name": "综艺立体花字",
        "is_vip": True
    },
    "美食-渐变小字": {
        "resource_id": "7205150731035266341",
        "effect_id": "7205150731035266341",
        "name": "美食-渐变小字",
        "is_vip": True
    },
    "金色渐变立体发光花字": {
        "resource_id": "7406007163417529638",
        "effect_id": "7406007163417529638",
        "name": "金色渐变立体发光花字",
        "is_vip": True
    },
    "粉色花字": {
        "resource_id": "7127655008715296031",
        "effect_id": "7127655008715296031",
        "name": "粉色花字",
        "is_vip": True
    },
    "粉色发光字": {
        "resource_id": "7403924857282432271",
        "effect_id": "7403924857282432271",
        "name": "粉色发光字",
        "is_vip": True
    },
    "蓝色发光": {
        "resource_id": "7346895765458947366",
        "effect_id": "7346895765458947366",
        "name": "蓝色发光",
        "is_vip": True
    },
    "元旦透明燥点花字-2022元旦": {
        "resource_id": "7179606734166592825",
        "effect_id": "7179606734166592825",
        "name": "元旦透明燥点花字-2022元旦",
        "is_vip": True
    },
    "红色渐变黄色发光花字": {
        "resource_id": "7406005354070379802",
        "effect_id": "7406005354070379802",
        "name": "红色渐变黄色发光花字",
        "is_vip": True
    },
    "蓝色霓虹灯发光花字": {
        "resource_id": "7408957503892884774",
        "effect_id": "7408957503892884774",
        "name": "蓝色霓虹灯发光花字",
        "is_vip": True
    },
    "黄色发光花字": {
        "resource_id": "7404896582182767908",
        "effect_id": "7404896582182767908",
        "name": "黄色发光花字",
        "is_vip": True
    },
    "金色渐变立体发光花字": {
        "resource_id": "7459717947620363582",
        "effect_id": "7459717947620363582",
        "name": "金色渐变立体发光花字",
        "is_vip": True
    },
    "蓝色发光花字": {
        "resource_id": "7404751791503576339",
        "effect_id": "7404751791503576339",
        "name": "蓝色发光花字",
        "is_vip": True
    },
    "圣诞红白条": {
        "resource_id": "7174330567222185253",
        "effect_id": "7174330567222185253",
        "name": "圣诞红白条",
        "is_vip": True
    },
    "粉色花字": {
        "resource_id": "7127839722893774087",
        "effect_id": "7127839722893774087",
        "name": "粉色花字",
        "is_vip": True
    },
    "潮酷白色发光立体花字": {
        "resource_id": "7160597532043644174",
        "effect_id": "7160597532043644174",
        "name": "潮酷白色发光立体花字",
        "is_vip": True
    },
    "综艺立体渐变": {
        "resource_id": "7160596088011951373",
        "effect_id": "7160596088011951373",
        "name": "综艺立体渐变",
        "is_vip": True
    },
    "黄色渐变花字": {
        "resource_id": "7273017604837625151",
        "effect_id": "7273017604837625151",
        "name": "黄色渐变花字",
        "is_vip": True
    },
    "发光": {
        "resource_id": "7346916622247955763",
        "effect_id": "7346916622247955763",
        "name": "发光",
        "is_vip": True
    },
    "闪光的新年花字-2022元旦": {
        "resource_id": "7179634097906519356",
        "effect_id": "7179634097906519356",
        "name": "闪光的新年花字-2022元旦",
        "is_vip": True
    },
    "红色渐变描边花字": {
        "resource_id": "7265622933702184232",
        "effect_id": "7265622933702184232",
        "name": "红色渐变描边花字",
        "is_vip": True
    },
    "粉色发光": {
        "resource_id": "7362142403416952115",
        "effect_id": "7362142403416952115",
        "name": "粉色发光",
        "is_vip": True
    },
    "霓虹灯黄红发光花字": {
        "resource_id": "7322482076958149914",
        "effect_id": "7322482076958149914",
        "name": "霓虹灯黄红发光花字",
        "is_vip": True
    },
    "洒金粉花字-2022元旦": {
        "resource_id": "7179628047832730941",
        "effect_id": "7179628047832730941",
        "name": "洒金粉花字-2022元旦",
        "is_vip": True
    },
    "元旦透明飘雪花字-2022元旦": {
        "resource_id": "7179616970399124795",
        "effect_id": "7179616970399124795",
        "name": "元旦透明飘雪花字-2022元旦",
        "is_vip": True
    },
    "浅蓝色发光花字": {
        "resource_id": "7281951975275597114",
        "effect_id": "7281951975275597114",
        "name": "浅蓝色发光花字",
        "is_vip": True
    },
    "红色内发光文字": {
        "resource_id": "7405197593808096527",
        "effect_id": "7405197593808096527",
        "name": "红色内发光文字",
        "is_vip": True
    },
    "克莱因蓝发光字体": {
        "resource_id": "7240995033393007931",
        "effect_id": "7240995033393007931",
        "name": "克莱因蓝发光字体",
        "is_vip": True
    },
    "红黄配色花字": {
        "resource_id": "7403941808302066979",
        "effect_id": "7403941808302066979",
        "name": "红黄配色花字",
        "is_vip": True
    },
    "红色发光花字": {
        "resource_id": "7128327279804976397",
        "effect_id": "7128327279804976397",
        "name": "红色发光花字",
        "is_vip": True
    },
    "黄色橙色描边花字": {
        "resource_id": "7241397134128352551",
        "effect_id": "7241397134128352551",
        "name": "黄色橙色描边花字",
        "is_vip": True
    },
    "霓虹灯发光红黄花字": {
        "resource_id": "7404014524900199706",
        "effect_id": "7404014524900199706",
        "name": "霓虹灯发光红黄花字",
        "is_vip": True
    },
    "薄荷冰花字": {
        "resource_id": "7312709252928277812",
        "effect_id": "7312709252928277812",
        "name": "薄荷冰花字",
        "is_vip": True
    },
    "荧光绿炫酷字体": {
        "resource_id": "7241480073759575357",
        "effect_id": "7241480073759575357",
        "name": "荧光绿炫酷字体",
        "is_vip": True
    },
    "渐变花字": {
        "resource_id": "7260439366953110825",
        "effect_id": "7260439366953110825",
        "name": "渐变花字",
        "is_vip": True
    },
    "烟雾纹理花字": {
        "resource_id": "7245610210386136357",
        "effect_id": "7245610210386136357",
        "name": "烟雾纹理花字",
        "is_vip": True
    },
    "红配蓝发光炫酷字体": {
        "resource_id": "7243255465822506255",
        "effect_id": "7243255465822506255",
        "name": "红配蓝发光炫酷字体",
        "is_vip": True
    },
    "潮酷发光立体花字": {
        "resource_id": "7160595918226525453",
        "effect_id": "7160595918226525453",
        "name": "潮酷发光立体花字",
        "is_vip": True
    },
    "电商节日直播贴片标题立体字": {
        "resource_id": "7406289529096719625",
        "effect_id": "7406289529096719625",
        "name": "电商节日直播贴片标题立体字",
        "is_vip": True
    },
    "渐变 蓝紫色花字": {
        "resource_id": "7336848964819504434",
        "effect_id": "7336848964819504434",
        "name": "渐变 蓝紫色花字",
        "is_vip": True
    },
    "蓝色渐变花字": {
        "resource_id": "7241432857447583028",
        "effect_id": "7241432857447583028",
        "name": "蓝色渐变花字",
        "is_vip": True
    },
    "黄色字荧光描边花字": {
        "resource_id": "7241389070943866164",
        "effect_id": "7241389070943866164",
        "name": "黄色字荧光描边花字",
        "is_vip": True
    },
    "粉色渐变描边花字": {
        "resource_id": "7265621281838533923",
        "effect_id": "7265621281838533923",
        "name": "粉色渐变描边花字",
        "is_vip": True
    },
    "圆环发光花字": {
        "resource_id": "7322679348106906918",
        "effect_id": "7322679348106906918",
        "name": "圆环发光花字",
        "is_vip": True
    },
    "绿色渐变描边花字": {
        "resource_id": "7265622422022262051",
        "effect_id": "7265622422022262051",
        "name": "绿色渐变描边花字",
        "is_vip": True
    },
    "白紫立体发光": {
        "resource_id": "7390410514976804122",
        "effect_id": "7390410514976804122",
        "name": "白紫立体发光",
        "is_vip": True
    },
    "甜粉": {
        "resource_id": "7266447274115419449",
        "effect_id": "7266447274115419449",
        "name": "甜粉",
        "is_vip": True
    },
    "红色霓虹灯发光花字": {
        "resource_id": "7408956912089206067",
        "effect_id": "7408956912089206067",
        "name": "红色霓虹灯发光花字",
        "is_vip": True
    },
    "金色花字": {
        "resource_id": "7266696486363106616",
        "effect_id": "7266696486363106616",
        "name": "金色花字",
        "is_vip": True
    },
    "空心白色描边发光花字": {
        "resource_id": "7404503527617301770",
        "effect_id": "7404503527617301770",
        "name": "空心白色描边发光花字",
        "is_vip": True
    },
    "白字蓝光花字": {
        "resource_id": "7351422706086169866",
        "effect_id": "7351422706086169866",
        "name": "白字蓝光花字",
        "is_vip": True
    },
    "亮黄字橙色描边发光花字": {
        "resource_id": "7404047060221037851",
        "effect_id": "7404047060221037851",
        "name": "亮黄字橙色描边发光花字",
        "is_vip": True
    },
    "冬季发光": {
        "resource_id": "7434806614781168947",
        "effect_id": "7434806614781168947",
        "name": "冬季发光",
        "is_vip": True
    },
    "黄的红边花字重叠": {
        "resource_id": "7231824394559982886",
        "effect_id": "7231824394559982886",
        "name": "黄的红边花字重叠",
        "is_vip": True
    },
    "渐变彩虹色发光花字": {
        "resource_id": "7405056348200684827",
        "effect_id": "7405056348200684827",
        "name": "渐变彩虹色发光花字",
        "is_vip": True
    },
    "霓虹灯发光花字": {
        "resource_id": "7322881735522290995",
        "effect_id": "7322881735522290995",
        "name": "霓虹灯发光花字",
        "is_vip": True
    },
    "绿色纹理立体花字": {
        "resource_id": "7391283375606156585",
        "effect_id": "7391283375606156585",
        "name": "绿色纹理立体花字",
        "is_vip": True
    },
    "红色霓虹灯发光字": {
        "resource_id": "7322678574719339802",
        "effect_id": "7322678574719339802",
        "name": "红色霓虹灯发光字",
        "is_vip": True
    },
    "星空": {
        "resource_id": "7266724384205786427",
        "effect_id": "7266724384205786427",
        "name": "星空",
        "is_vip": True
    },
    "美食-中间渐变": {
        "resource_id": "7212896736849841467",
        "effect_id": "7212896736849841467",
        "name": "美食-中间渐变",
        "is_vip": True
    },
    "夏日的亮丽 ": {
        "resource_id": "7259709733790125366",
        "effect_id": "7259709733790125366",
        "name": "夏日的亮丽 ",
        "is_vip": True
    },
    "纯黑底色，荧光绿和黑色描边 立体 发光 花字": {
        "resource_id": "7274035971207744824",
        "effect_id": "7274035971207744824",
        "name": "纯黑底色，荧光绿和黑色描边 立体 发光 花字",
        "is_vip": True
    },
    "黄色蓝色发发光花字": {
        "resource_id": "7241392284686683395",
        "effect_id": "7241392284686683395",
        "name": "黄色蓝色发发光花字",
        "is_vip": True
    },
    "梦幻蓝紫色简约渐变花字": {
        "resource_id": "7241477841567649080",
        "effect_id": "7241477841567649080",
        "name": "梦幻蓝紫色简约渐变花字",
        "is_vip": True
    },
    "红色荧光花字": {
        "resource_id": "7241410291521670400",
        "effect_id": "7241410291521670400",
        "name": "红色荧光花字",
        "is_vip": True
    },
    "彩色发光立体": {
        "resource_id": "7390315130128452890",
        "effect_id": "7390315130128452890",
        "name": "彩色发光立体",
        "is_vip": True
    },
    "黄色渐变发光字": {
        "resource_id": "7404001083665812771",
        "effect_id": "7404001083665812771",
        "name": "黄色渐变发光字",
        "is_vip": True
    },
    "发光灯箱感红色花字": {
        "resource_id": "6926827744189779207",
        "effect_id": "6926827744189779207",
        "name": "发光灯箱感红色花字",
        "is_vip": True
    },
    "霓虹灯发光花字": {
        "resource_id": "7322422789355392265",
        "effect_id": "7322422789355392265",
        "name": "霓虹灯发光花字",
        "is_vip": True
    },
    "黑色红边柔光花字": {
        "resource_id": "7231468045976292645",
        "effect_id": "7231468045976292645",
        "name": "黑色红边柔光花字",
        "is_vip": True
    },
    "粉色渐变温柔发光花字": {
        "resource_id": "7404385123975613706",
        "effect_id": "7404385123975613706",
        "name": "粉色渐变温柔发光花字",
        "is_vip": True
    },
    "渐变紫色花字": {
        "resource_id": "7241393396575735040",
        "effect_id": "7241393396575735040",
        "name": "渐变紫色花字",
        "is_vip": True
    },
    "红配绿发光拼色字体": {
        "resource_id": "7243262147210267944",
        "effect_id": "7243262147210267944",
        "name": "红配绿发光拼色字体",
        "is_vip": True
    },
    "黑底荧光绿描边 发光 花字": {
        "resource_id": "7273831317136035133",
        "effect_id": "7273831317136035133",
        "name": "黑底荧光绿描边 发光 花字",
        "is_vip": True
    },
    "霓虹灯发光花字": {
        "resource_id": "7322380988430994715",
        "effect_id": "7322380988430994715",
        "name": "霓虹灯发光花字",
        "is_vip": True
    },
    "绿字蓝白描边荧光字": {
        "resource_id": "7403932533995425039",
        "effect_id": "7403932533995425039",
        "name": "绿字蓝白描边荧光字",
        "is_vip": True
    },
    "粉色渐变双层立体发光花字": {
        "resource_id": "7494822504427539737",
        "effect_id": "7494822504427539737",
        "name": "粉色渐变双层立体发光花字",
        "is_vip": True
    },
    "东南亚渐变": {
        "resource_id": "7411034104415685939",
        "effect_id": "7411034104415685939",
        "name": "东南亚渐变",
        "is_vip": True
    },
    "蓝色渐变花字": {
        "resource_id": "7241398727125011746",
        "effect_id": "7241398727125011746",
        "name": "蓝色渐变花字",
        "is_vip": True
    },
    "黄红色霓虹灯镂空发光花字": {
        "resource_id": "7404089520070593843",
        "effect_id": "7404089520070593843",
        "name": "黄红色霓虹灯镂空发光花字",
        "is_vip": True
    },
    "粉色渐变圆圈": {
        "resource_id": "7403922592194710834",
        "effect_id": "7403922592194710834",
        "name": "粉色渐变圆圈",
        "is_vip": True
    },
    "紫色发光花字": {
        "resource_id": "7248870704752397579",
        "effect_id": "7248870704752397579",
        "name": "紫色发光花字",
        "is_vip": True
    },
    "粉色发光": {
        "resource_id": "7361004787967495462",
        "effect_id": "7361004787967495462",
        "name": "粉色发光",
        "is_vip": True
    },
    "纯色黄色字体": {
        "resource_id": "7260373127249595687",
        "effect_id": "7260373127249595687",
        "name": "纯色黄色字体",
        "is_vip": True
    },
    "紫色发光字": {
        "resource_id": "7403992509212314920",
        "effect_id": "7403992509212314920",
        "name": "紫色发光字",
        "is_vip": True
    },
    "粉色闪粉星光闪闪发光划走": {
        "resource_id": "7496497861224516926",
        "effect_id": "7496497861224516926",
        "name": "粉色闪粉星光闪闪发光划走",
        "is_vip": True
    },
    "绿底黑边黄色立体花字": {
        "resource_id": "7270129109974469945",
        "effect_id": "7270129109974469945",
        "name": "绿底黑边黄色立体花字",
        "is_vip": True
    },
    "简约蓝": {
        "resource_id": "7264481843301354813",
        "effect_id": "7264481843301354813",
        "name": "简约蓝",
        "is_vip": True
    },
    "花粉绿": {
        "resource_id": "7241230847741791521",
        "effect_id": "7241230847741791521",
        "name": "花粉绿",
        "is_vip": True
    },
    "粉色发光立体花字": {
        "resource_id": "7404070348263607603",
        "effect_id": "7404070348263607603",
        "name": "粉色发光立体花字",
        "is_vip": True
    },
    "绿色渐变立体描边花字": {
        "resource_id": "7406241968847670569",
        "effect_id": "7406241968847670569",
        "name": "绿色渐变立体描边花字",
        "is_vip": True
    },
    "粉色糖果风格花字": {
        "resource_id": "7291429737774255412",
        "effect_id": "7291429737774255412",
        "name": "粉色糖果风格花字",
        "is_vip": True
    },
    "紫色花字": {
        "resource_id": "7355608527144062217",
        "effect_id": "7355608527144062217",
        "name": "紫色花字",
        "is_vip": True
    },
    "渐变发光花字": {
        "resource_id": "7238624559178485031",
        "effect_id": "7238624559178485031",
        "name": "渐变发光花字",
        "is_vip": True
    },
    "荧光绿线条发光字": {
        "resource_id": "7405916937353465128",
        "effect_id": "7405916937353465128",
        "name": "荧光绿线条发光字",
        "is_vip": True
    },
    "渐变花字": {
        "resource_id": "7270718850256211259",
        "effect_id": "7270718850256211259",
        "name": "渐变花字",
        "is_vip": True
    },
    "粉色发光花字": {
        "resource_id": "7274771737999379749",
        "effect_id": "7274771737999379749",
        "name": "粉色发光花字",
        "is_vip": True
    },
    "粉色闪粉白色描边发光花字": {
        "resource_id": "7404388775264030003",
        "effect_id": "7404388775264030003",
        "name": "粉色闪粉白色描边发光花字",
        "is_vip": True
    },
    "紫红发光字": {
        "resource_id": "7405417769446968610",
        "effect_id": "7405417769446968610",
        "name": "紫红发光字",
        "is_vip": True
    },
    "彩色渐变花字": {
        "resource_id": "7248130865094561036",
        "effect_id": "7248130865094561036",
        "name": "彩色渐变花字",
        "is_vip": True
    },
    "绿色立体花字": {
        "resource_id": "7241415162345852194",
        "effect_id": "7241415162345852194",
        "name": "绿色立体花字",
        "is_vip": True
    },
    "条纹黄色综艺发光花字": {
        "resource_id": "7275250557386788156",
        "effect_id": "7275250557386788156",
        "name": "条纹黄色综艺发光花字",
        "is_vip": True
    },
    "梦幻紫星光双层立体花字": {
        "resource_id": "7404321217110396187",
        "effect_id": "7404321217110396187",
        "name": "梦幻紫星光双层立体花字",
        "is_vip": True
    },
    "粉色闪闪": {
        "resource_id": "7529808923725925657",
        "effect_id": "7529808923725925657",
        "name": "粉色闪闪",
        "is_vip": True
    },
    "荧光线条发光字": {
        "resource_id": "7405939554047233295",
        "effect_id": "7405939554047233295",
        "name": "荧光线条发光字",
        "is_vip": True
    },
    "机械装甲绿色科技感文字标题": {
        "resource_id": "7327845943305358646",
        "effect_id": "7327845943305358646",
        "name": "机械装甲绿色科技感文字标题",
        "is_vip": True
    },
    "发光灯箱感绿色描边立体花字": {
        "resource_id": "7404100687820229922",
        "effect_id": "7404100687820229922",
        "name": "发光灯箱感绿色描边立体花字",
        "is_vip": True
    },
    "白花纹发光花字": {
        "resource_id": "7259233733964811572",
        "effect_id": "7259233733964811572",
        "name": "白花纹发光花字",
        "is_vip": True
    },
    "清新绿色 绿色花字": {
        "resource_id": "7334225752663149850",
        "effect_id": "7334225752663149850",
        "name": "清新绿色 绿色花字",
        "is_vip": True
    },
    "浅绿色 绿色花字底发光": {
        "resource_id": "7334229773402606886",
        "effect_id": "7334229773402606886",
        "name": "浅绿色 绿色花字底发光",
        "is_vip": True
    },
    "夏日青春派对": {
        "resource_id": "7249749880611015988",
        "effect_id": "7249749880611015988",
        "name": "夏日青春派对",
        "is_vip": True
    },
    "紫色发光字": {
        "resource_id": "7406201706456960256",
        "effect_id": "7406201706456960256",
        "name": "紫色发光字",
        "is_vip": True
    },
    "白色描边芭比粉发光花字": {
        "resource_id": "7404708538926353700",
        "effect_id": "7404708538926353700",
        "name": "白色描边芭比粉发光花字",
        "is_vip": True
    },
    "花字-雪花彩粉渐变立体字": {
        "resource_id": "7232089500518862140",
        "effect_id": "7232089500518862140",
        "name": "花字-雪花彩粉渐变立体字",
        "is_vip": True
    },
    "赛博朋克纹理发光字": {
        "resource_id": "7405875861712342307",
        "effect_id": "7405875861712342307",
        "name": "赛博朋克纹理发光字",
        "is_vip": True
    },
    "浅梦幻少女色": {
        "resource_id": "7281283804235402533",
        "effect_id": "7281283804235402533",
        "name": "浅梦幻少女色",
        "is_vip": True
    },
    "彩色镭射渐变花字": {
        "resource_id": "7404330497574309129",
        "effect_id": "7404330497574309129",
        "name": "彩色镭射渐变花字",
        "is_vip": True
    },
    "紫色发光立体花字": {
        "resource_id": "7245923862574009635",
        "effect_id": "7245923862574009635",
        "name": "紫色发光立体花字",
        "is_vip": True
    },
    "薄荷绿花字": {
        "resource_id": "7404021791427005723",
        "effect_id": "7404021791427005723",
        "name": "薄荷绿花字",
        "is_vip": True
    },
    "青色 红色 荧光花字": {
        "resource_id": "7241393660334574848",
        "effect_id": "7241393660334574848",
        "name": "青色 红色 荧光花字",
        "is_vip": True
    },
    "绿色花字": {
        "resource_id": "7351303614104636699",
        "effect_id": "7351303614104636699",
        "name": "绿色花字",
        "is_vip": True
    },
    "紫宝石": {
        "resource_id": "7241904291722693944",
        "effect_id": "7241904291722693944",
        "name": "紫宝石",
        "is_vip": True
    },
    "粉橙色花字": {
        "resource_id": "7241388504381541666",
        "effect_id": "7241388504381541666",
        "name": "粉橙色花字",
        "is_vip": True
    },
    "格子纹理花字": {
        "resource_id": "7260122300564000012",
        "effect_id": "7260122300564000012",
        "name": "格子纹理花字",
        "is_vip": True
    },
    "复古格子清新蓝花字": {
        "resource_id": "7297906734755073319",
        "effect_id": "7297906734755073319",
        "name": "复古格子清新蓝花字",
        "is_vip": True
    },
    "深绿色黑边紫光花字": {
        "resource_id": "7231501962041117955",
        "effect_id": "7231501962041117955",
        "name": "深绿色黑边紫光花字",
        "is_vip": True
    },
    "紫色粉边花字": {
        "resource_id": "7291157036098735401",
        "effect_id": "7291157036098735401",
        "name": "紫色粉边花字",
        "is_vip": True
    },
    "清新蓝色发光花字": {
        "resource_id": "6896138122774514951",
        "effect_id": "6896138122774514951",
        "name": "清新蓝色发光花字",
        "is_vip": False
    },
    "潮酷 白色橙边": {
        "resource_id": "7127615338035924238",
        "effect_id": "7127615338035924238",
        "name": "潮酷 白色橙边",
        "is_vip": False
    },
    "简约白色发光立体花字": {
        "resource_id": "7166445713029729568",
        "effect_id": "7166445713029729568",
        "name": "简约白色发光立体花字",
        "is_vip": False
    },
    "超酷发光镂空花字、潮人必备": {
        "resource_id": "6896141886055107854",
        "effect_id": "6896141886055107854",
        "name": "超酷发光镂空花字、潮人必备",
        "is_vip": False
    },
    "潮酷蓝色发光镂空花字": {
        "resource_id": "6896141886055091470",
        "effect_id": "6896141886055091470",
        "name": "潮酷蓝色发光镂空花字",
        "is_vip": False
    },
    "综艺 橙色": {
        "resource_id": "7127654126997048607",
        "effect_id": "7127654126997048607",
        "name": "综艺 橙色",
        "is_vip": False
    },
    "清新粉色发光灯箱感花字": {
        "resource_id": "6896138122774531335",
        "effect_id": "6896138122774531335",
        "name": "清新粉色发光灯箱感花字",
        "is_vip": False
    },
    "炫彩发光跳色花字，": {
        "resource_id": "6896141886055058702",
        "effect_id": "6896141886055058702",
        "name": "炫彩发光跳色花字，",
        "is_vip": False
    },
    "潮酷 橙色": {
        "resource_id": "7127817897061125413",
        "effect_id": "7127817897061125413",
        "name": "潮酷 橙色",
        "is_vip": False
    },
    "潮酷黄色霓虹灯花字": {
        "resource_id": "6926796566346960141",
        "effect_id": "6926796566346960141",
        "name": "潮酷黄色霓虹灯花字",
        "is_vip": False
    },
    "红色镂空发光花字": {
        "resource_id": "6926825801258126599",
        "effect_id": "6926825801258126599",
        "name": "红色镂空发光花字",
        "is_vip": False
    },
    "潮酷蓝色霓虹灯发光花字": {
        "resource_id": "6926827744189795591",
        "effect_id": "6926827744189795591",
        "name": "潮酷蓝色霓虹灯发光花字",
        "is_vip": False
    },
    "潮酷黄底白色发光立体花字": {
        "resource_id": "7187616139642522936",
        "effect_id": "7187616139642522936",
        "name": "潮酷黄底白色发光立体花字",
        "is_vip": False
    },
    "蓝色镂空发光花字": {
        "resource_id": "6927159112887176459",
        "effect_id": "6927159112887176459",
        "name": "蓝色镂空发光花字",
        "is_vip": False
    },
    "潮酷 白色粉边": {
        "resource_id": "7127819154018602277",
        "effect_id": "7127819154018602277",
        "name": "潮酷 白色粉边",
        "is_vip": False
    },
    "暗黑潮酷黑色花字": {
        "resource_id": "6926825801258159367",
        "effect_id": "6926825801258159367",
        "name": "暗黑潮酷黑色花字",
        "is_vip": False
    },
    "超酷黄色发光花字": {
        "resource_id": "6896143968241798408",
        "effect_id": "6896143968241798408",
        "name": "超酷黄色发光花字",
        "is_vip": False
    },
    "小清新 白色": {
        "resource_id": "7127680616283295006",
        "effect_id": "7127680616283295006",
        "name": "小清新 白色",
        "is_vip": False
    },
    "黄色发光字": {
        "resource_id": "7405565480678739200",
        "effect_id": "7405565480678739200",
        "name": "黄色发光字",
        "is_vip": False
    },
    "炫彩发光花字，跳字变色": {
        "resource_id": "6896141886055075086",
        "effect_id": "6896141886055075086",
        "name": "炫彩发光花字，跳字变色",
        "is_vip": False
    },
    "发光灯箱感绿色花字": {
        "resource_id": "6896144021568179469",
        "effect_id": "6896144021568179469",
        "name": "发光灯箱感绿色花字",
        "is_vip": False
    },
    "潮酷黄色发光花字": {
        "resource_id": "6926825801384021256",
        "effect_id": "6926825801384021256",
        "name": "潮酷黄色发光花字",
        "is_vip": False
    },
    "复古 红色": {
        "resource_id": "7127827287826779428",
        "effect_id": "7127827287826779428",
        "name": "复古 红色",
        "is_vip": False
    },
    "赛博朋克未来科技感立体发光花字": {
        "resource_id": "7404088879780826406",
        "effect_id": "7404088879780826406",
        "name": "赛博朋克未来科技感立体发光花字",
        "is_vip": False
    },
    "红色潮酷外发光花字": {
        "resource_id": "6927160254996253967",
        "effect_id": "6927160254996253967",
        "name": "红色潮酷外发光花字",
        "is_vip": False
    },
    "红色朦胧港风复古花字": {
        "resource_id": "6927160144421866752",
        "effect_id": "6927160144421866752",
        "name": "红色朦胧港风复古花字",
        "is_vip": False
    },
    "Y2k粉色立体灯箱发光花字": {
        "resource_id": "7127675252410289445",
        "effect_id": "7127675252410289445",
        "name": "Y2k粉色立体灯箱发光花字",
        "is_vip": False
    },
    "潮酷粉色发光镂空花字": {
        "resource_id": "6896143968241782024",
        "effect_id": "6896143968241782024",
        "name": "潮酷粉色发光镂空花字",
        "is_vip": False
    },
    "梦幻粉色发光立体花字": {
        "resource_id": "7197333872466611513",
        "effect_id": "7197333872466611513",
        "name": "梦幻粉色发光立体花字",
        "is_vip": False
    },
    "潮酷发光青色": {
        "resource_id": "7127669605199351048",
        "effect_id": "7127669605199351048",
        "name": "潮酷发光青色",
        "is_vip": False
    },
    "黄橙渐变黑红描边立体字": {
        "resource_id": "7403926640260123944",
        "effect_id": "7403926640260123944",
        "name": "黄橙渐变黑红描边立体字",
        "is_vip": True
    },
    "蓝色纹理立体发光花字": {
        "resource_id": "7430703360409554212",
        "effect_id": "7430703360409554212",
        "name": "蓝色纹理立体发光花字",
        "is_vip": True
    },
    "黄色渐变红边发光花字": {
        "resource_id": "7407014765907774747",
        "effect_id": "7407014765907774747",
        "name": "黄色渐变红边发光花字",
        "is_vip": True
    },
    "潮酷发光立体花字": {
        "resource_id": "7160596855456320776",
        "effect_id": "7160596855456320776",
        "name": "潮酷发光立体花字",
        "is_vip": True
    },
    "立体金属字": {
        "resource_id": "7317088712154696969",
        "effect_id": "7317088712154696969",
        "name": "立体金属字",
        "is_vip": True
    },
    "黑金色立体花字": {
        "resource_id": "7244940532298829090",
        "effect_id": "7244940532298829090",
        "name": "黑金色立体花字",
        "is_vip": True
    },
    "黑灰色花字【严肃】": {
        "resource_id": "7281947750139219257",
        "effect_id": "7281947750139219257",
        "name": "黑灰色花字【严肃】",
        "is_vip": True
    },
    "美食-黄网格": {
        "resource_id": "7212896770370587941",
        "effect_id": "7212896770370587941",
        "name": "美食-黄网格",
        "is_vip": True
    },
    "金属灰渐变立体白边花字": {
        "resource_id": "7388020661312146751",
        "effect_id": "7388020661312146751",
        "name": "金属灰渐变立体白边花字",
        "is_vip": True
    },
    "一窝时光标题花字字体设计美食海报大气简约醒目小龙虾": {
        "resource_id": "7260358084772547903",
        "effect_id": "7260358084772547903",
        "name": "一窝时光标题花字字体设计美食海报大气简约醒目小龙虾",
        "is_vip": True
    },
    "蓝色渐变3D立体花字": {
        "resource_id": "7405125461438762267",
        "effect_id": "7405125461438762267",
        "name": "蓝色渐变3D立体花字",
        "is_vip": True
    },
    "立体效果": {
        "resource_id": "7274581371975142710",
        "effect_id": "7274581371975142710",
        "name": "立体效果",
        "is_vip": True
    },
    "美食-金色网格": {
        "resource_id": "7212897121249283383",
        "effect_id": "7212897121249283383",
        "name": "美食-金色网格",
        "is_vip": True
    },
    "土酷蓝色渐变立体花字": {
        "resource_id": "7160599091750145287",
        "effect_id": "7160599091750145287",
        "name": "土酷蓝色渐变立体花字",
        "is_vip": True
    },
    "蓝色渐变花字": {
        "resource_id": "7220003213171281192",
        "effect_id": "7220003213171281192",
        "name": "蓝色渐变花字",
        "is_vip": True
    },
    "黄色渐变花字": {
        "resource_id": "7265625223381273891",
        "effect_id": "7265625223381273891",
        "name": "黄色渐变花字",
        "is_vip": True
    },
    "黄色渐变花字": {
        "resource_id": "7493083674158796094",
        "effect_id": "7493083674158796094",
        "name": "黄色渐变花字",
        "is_vip": True
    },
    "黄白涂鸦花字": {
        "resource_id": "7369091570345282866",
        "effect_id": "7369091570345282866",
        "name": "黄白涂鸦花字",
        "is_vip": True
    },
    "黑灰渐变": {
        "resource_id": "7224762483448237345",
        "effect_id": "7224762483448237345",
        "name": "黑灰渐变",
        "is_vip": True
    },
    "彩色渐变描边": {
        "resource_id": "7369985913310448911",
        "effect_id": "7369985913310448911",
        "name": "彩色渐变描边",
        "is_vip": True
    },
    "黄色渐变花字": {
        "resource_id": "7439987370033728807",
        "effect_id": "7439987370033728807",
        "name": "黄色渐变花字",
        "is_vip": True
    },
    "橘黄色渐变波点底纹立体花字": {
        "resource_id": "7405889740081237285",
        "effect_id": "7405889740081237285",
        "name": "橘黄色渐变波点底纹立体花字",
        "is_vip": True
    },
    "大雪渐变": {
        "resource_id": "7431533312738348314",
        "effect_id": "7431533312738348314",
        "name": "大雪渐变",
        "is_vip": True
    },
    "黑白配": {
        "resource_id": "7268912246900772135",
        "effect_id": "7268912246900772135",
        "name": "黑白配",
        "is_vip": True
    },
    "美食-黄白跳色": {
        "resource_id": "7252679635027168567",
        "effect_id": "7252679635027168567",
        "name": "美食-黄白跳色",
        "is_vip": True
    },
    "蓝色渐变立体描边花字": {
        "resource_id": "7511237110914125080",
        "effect_id": "7511237110914125080",
        "name": "蓝色渐变立体描边花字",
        "is_vip": True
    },
    "美食-弹幕": {
        "resource_id": "7212885712495070519",
        "effect_id": "7212885712495070519",
        "name": "美食-弹幕",
        "is_vip": True
    },
    "蓝色花字": {
        "resource_id": "7264536942832848165",
        "effect_id": "7264536942832848165",
        "name": "蓝色花字",
        "is_vip": True
    },
    "橘色渐变描边花字": {
        "resource_id": "7265622781008629032",
        "effect_id": "7265622781008629032",
        "name": "橘色渐变描边花字",
        "is_vip": True
    },
    "黄橙色渐变描边立体花字": {
        "resource_id": "7405056217225104681",
        "effect_id": "7405056217225104681",
        "name": "黄橙色渐变描边立体花字",
        "is_vip": True
    },
    "金色渐变 金灿灿花字 富贵": {
        "resource_id": "7328610126296796468",
        "effect_id": "7328610126296796468",
        "name": "金色渐变 金灿灿花字 富贵",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7491562659268119870",
        "effect_id": "7491562659268119870",
        "name": "花字",
        "is_vip": True
    },
    "暗黑红黑渐立体花字": {
        "resource_id": "7205151372805754167",
        "effect_id": "7205151372805754167",
        "name": "暗黑红黑渐立体花字",
        "is_vip": True
    },
    "粉色渐变红色底花字": {
        "resource_id": "7404684532756073791",
        "effect_id": "7404684532756073791",
        "name": "粉色渐变红色底花字",
        "is_vip": True
    },
    "黄色渐变立体花字": {
        "resource_id": "7313119295792352539",
        "effect_id": "7313119295792352539",
        "name": "黄色渐变立体花字",
        "is_vip": True
    },
    "综艺立体花字": {
        "resource_id": "7160601969629891847",
        "effect_id": "7160601969629891847",
        "name": "综艺立体花字",
        "is_vip": True
    },
    "扁平化请新白蓝": {
        "resource_id": "7233363221497842977",
        "effect_id": "7233363221497842977",
        "name": "扁平化请新白蓝",
        "is_vip": True
    },
    "春节-兔彩头-银色立体": {
        "resource_id": "7187770975822433594",
        "effect_id": "7187770975822433594",
        "name": "春节-兔彩头-银色立体",
        "is_vip": True
    },
    "蓝色渐变花字": {
        "resource_id": "7404899700970753321",
        "effect_id": "7404899700970753321",
        "name": "蓝色渐变花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7530918113899105561",
        "effect_id": "7530918113899105561",
        "name": "花字",
        "is_vip": True
    },
    "七夕-粉白渐变": {
        "resource_id": "7265298421341277452",
        "effect_id": "7265298421341277452",
        "name": "七夕-粉白渐变",
        "is_vip": True
    },
    "金色红底春节喜庆花字": {
        "resource_id": "7324218891222240522",
        "effect_id": "7324218891222240522",
        "name": "金色红底春节喜庆花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7431462520835099955",
        "effect_id": "7431462520835099955",
        "name": "花字",
        "is_vip": True
    },
    "金色渐变红底立体花字": {
        "resource_id": "7324255228310654235",
        "effect_id": "7324255228310654235",
        "name": "金色渐变红底立体花字",
        "is_vip": True
    },
    "黄红渐变黑边立体花字": {
        "resource_id": "7431549062475762959",
        "effect_id": "7431549062475762959",
        "name": "黄红渐变黑边立体花字",
        "is_vip": True
    },
    "美食-红黄渐变": {
        "resource_id": "7205154202757172541",
        "effect_id": "7205154202757172541",
        "name": "美食-红黄渐变",
        "is_vip": True
    },
    "美食-划痕渐变": {
        "resource_id": "7212896808798801213",
        "effect_id": "7212896808798801213",
        "name": "美食-划痕渐变",
        "is_vip": True
    },
    "蓝色渐变白色描边花字": {
        "resource_id": "7330967545240964404",
        "effect_id": "7330967545240964404",
        "name": "蓝色渐变白色描边花字",
        "is_vip": True
    },
    "渐变蓝色花字": {
        "resource_id": "7384325883584056617",
        "effect_id": "7384325883584056617",
        "name": "渐变蓝色花字",
        "is_vip": True
    },
    "红色描边双色渐变立体花字": {
        "resource_id": "7391023993802804521",
        "effect_id": "7391023993802804521",
        "name": "红色描边双色渐变立体花字",
        "is_vip": True
    },
    "橙色渐变波点双层立体花字": {
        "resource_id": "7404880919582018854",
        "effect_id": "7404880919582018854",
        "name": "橙色渐变波点双层立体花字",
        "is_vip": True
    },
    "浅蓝粉渐变立体花字": {
        "resource_id": "7312840128949505307",
        "effect_id": "7312840128949505307",
        "name": "浅蓝粉渐变立体花字",
        "is_vip": True
    },
    "紫色立体花字": {
        "resource_id": "7399918916232826123",
        "effect_id": "7399918916232826123",
        "name": "紫色立体花字",
        "is_vip": True
    },
    "简约蓝色渐变立体花字": {
        "resource_id": "7248118492111703357",
        "effect_id": "7248118492111703357",
        "name": "简约蓝色渐变立体花字",
        "is_vip": True
    },
    "黄蓝撞色渐变立体花字": {
        "resource_id": "7405583007098195237",
        "effect_id": "7405583007098195237",
        "name": "黄蓝撞色渐变立体花字",
        "is_vip": True
    },
    "彩色渐变": {
        "resource_id": "7369988046277594383",
        "effect_id": "7369988046277594383",
        "name": "彩色渐变",
        "is_vip": True
    },
    "黄橘渐变": {
        "resource_id": "7410717398510128424",
        "effect_id": "7410717398510128424",
        "name": "黄橘渐变",
        "is_vip": True
    },
    "红色渐变透明花字": {
        "resource_id": "7405253473299696931",
        "effect_id": "7405253473299696931",
        "name": "红色渐变透明花字",
        "is_vip": True
    },
    "雪花字": {
        "resource_id": "7298358091664362793",
        "effect_id": "7298358091664362793",
        "name": "雪花字",
        "is_vip": True
    },
    "美食-辣": {
        "resource_id": "7205147811573271864",
        "effect_id": "7205147811573271864",
        "name": "美食-辣",
        "is_vip": True
    },
    "黄白色渐变立体花字": {
        "resource_id": "7493079330654899480",
        "effect_id": "7493079330654899480",
        "name": "黄白色渐变立体花字",
        "is_vip": True
    },
    "彩色": {
        "resource_id": "7369460089767480614",
        "effect_id": "7369460089767480614",
        "name": "彩色",
        "is_vip": True
    },
    "白字霓虹灯渐变花字": {
        "resource_id": "7406294702212877619",
        "effect_id": "7406294702212877619",
        "name": "白字霓虹灯渐变花字",
        "is_vip": True
    },
    "冬日寒冷发光花字": {
        "resource_id": "7263267444020596005",
        "effect_id": "7263267444020596005",
        "name": "冬日寒冷发光花字",
        "is_vip": True
    },
    "彩色渐变花字": {
        "resource_id": "7405953290271198491",
        "effect_id": "7405953290271198491",
        "name": "彩色渐变花字",
        "is_vip": True
    },
    "黄绿渐变发光字": {
        "resource_id": "7406253347746876706",
        "effect_id": "7406253347746876706",
        "name": "黄绿渐变发光字",
        "is_vip": True
    },
    "黄色渐变描边立体花字": {
        "resource_id": "7383803879730842931",
        "effect_id": "7383803879730842931",
        "name": "黄色渐变描边立体花字",
        "is_vip": True
    },
    "简约渐变花字": {
        "resource_id": "7236638821901733175",
        "effect_id": "7236638821901733175",
        "name": "简约渐变花字",
        "is_vip": True
    },
    "黄色渐变橙蓝色描边立体花字": {
        "resource_id": "7505100141288901950",
        "effect_id": "7505100141288901950",
        "name": "黄色渐变橙蓝色描边立体花字",
        "is_vip": True
    },
    "白绿紫渐变": {
        "resource_id": "7127664822887402759",
        "effect_id": "7127664822887402759",
        "name": "白绿紫渐变",
        "is_vip": True
    },
    "蓝绿渐变花字": {
        "resource_id": "7391445684953681192",
        "effect_id": "7391445684953681192",
        "name": "蓝绿渐变花字",
        "is_vip": True
    },
    "紫色立体渐变": {
        "resource_id": "7376115629230673204",
        "effect_id": "7376115629230673204",
        "name": "紫色立体渐变",
        "is_vip": True
    },
    "蓝色纹理发光立体花字": {
        "resource_id": "7430709931411623204",
        "effect_id": "7430709931411623204",
        "name": "蓝色纹理发光立体花字",
        "is_vip": True
    },
    "黄色渐变双色描边花字": {
        "resource_id": "7265636111211449634",
        "effect_id": "7265636111211449634",
        "name": "黄色渐变双色描边花字",
        "is_vip": True
    },
    "蓝色渐变花字": {
        "resource_id": "7285696655989411133",
        "effect_id": "7285696655989411133",
        "name": "蓝色渐变花字",
        "is_vip": True
    },
    "黄绿花纹立体字": {
        "resource_id": "7404026606869613864",
        "effect_id": "7404026606869613864",
        "name": "黄绿花纹立体字",
        "is_vip": True
    },
    "星空梦幻炫彩立体花字": {
        "resource_id": "7404369195875487016",
        "effect_id": "7404369195875487016",
        "name": "星空梦幻炫彩立体花字",
        "is_vip": True
    },
    "紫色 立体 渐变 花字": {
        "resource_id": "7527575726220987672",
        "effect_id": "7527575726220987672",
        "name": "紫色 立体 渐变 花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7241433848943365436",
        "effect_id": "7241433848943365436",
        "name": "花字",
        "is_vip": True
    },
    "蓝字彩虹渐变描边花字": {
        "resource_id": "7404026005389708595",
        "effect_id": "7404026005389708595",
        "name": "蓝字彩虹渐变描边花字",
        "is_vip": True
    },
    "国风粉色渐变": {
        "resource_id": "7406640534036532490",
        "effect_id": "7406640534036532490",
        "name": "国风粉色渐变",
        "is_vip": True
    },
    "多色渐变花字": {
        "resource_id": "7405867875317173516",
        "effect_id": "7405867875317173516",
        "name": "多色渐变花字",
        "is_vip": True
    },
    "蓝色渐变立体花字": {
        "resource_id": "7371124565839301925",
        "effect_id": "7371124565839301925",
        "name": "蓝色渐变立体花字",
        "is_vip": True
    },
    "渐变白色描边花字": {
        "resource_id": "7405949704904658203",
        "effect_id": "7405949704904658203",
        "name": "渐变白色描边花字",
        "is_vip": True
    },
    "黄色手绘蜡笔质感花字": {
        "resource_id": "7366899343451852058",
        "effect_id": "7366899343451852058",
        "name": "黄色手绘蜡笔质感花字",
        "is_vip": True
    },
    "3D渐变绿色立体花字": {
        "resource_id": "7404710833344892196",
        "effect_id": "7404710833344892196",
        "name": "3D渐变绿色立体花字",
        "is_vip": True
    },
    "简约双层描边蓝色渐变花字": {
        "resource_id": "7497111940762995993",
        "effect_id": "7497111940762995993",
        "name": "简约双层描边蓝色渐变花字",
        "is_vip": True
    },
    "五色花字": {
        "resource_id": "7430992115376704819",
        "effect_id": "7430992115376704819",
        "name": "五色花字",
        "is_vip": True
    },
    "炫彩星空花字": {
        "resource_id": "6896143862222327047",
        "effect_id": "6896143862222327047",
        "name": "炫彩星空花字",
        "is_vip": True
    },
    "美妆立体": {
        "resource_id": "7482318463755734334",
        "effect_id": "7482318463755734334",
        "name": "美妆立体",
        "is_vip": True
    },
    "忧郁蓝": {
        "resource_id": "7481306716752219417",
        "effect_id": "7481306716752219417",
        "name": "忧郁蓝",
        "is_vip": True
    },
    "黑底纹粉渐变描边发光花字": {
        "resource_id": "7407010177842482459",
        "effect_id": "7407010177842482459",
        "name": "黑底纹粉渐变描边发光花字",
        "is_vip": True
    },
    "粉色渐变镂空描边": {
        "resource_id": "7406359623545933093",
        "effect_id": "7406359623545933093",
        "name": "粉色渐变镂空描边",
        "is_vip": True
    },
    "金色渐变描边花字": {
        "resource_id": "7391015553818692927",
        "effect_id": "7391015553818692927",
        "name": "金色渐变描边花字",
        "is_vip": True
    },
    "白字花字": {
        "resource_id": "7404038278057332005",
        "effect_id": "7404038278057332005",
        "name": "白字花字",
        "is_vip": True
    },
    "暗色花字": {
        "resource_id": "7249649958297783589",
        "effect_id": "7249649958297783589",
        "name": "暗色花字",
        "is_vip": True
    },
    "双十一-彩色立体字": {
        "resource_id": "7296106361153293618",
        "effect_id": "7296106361153293618",
        "name": "双十一-彩色立体字",
        "is_vip": True
    },
    "天蓝色渐变花字": {
        "resource_id": "7241433473796394255",
        "effect_id": "7241433473796394255",
        "name": "天蓝色渐变花字",
        "is_vip": True
    },
    "红色渐变立体文字": {
        "resource_id": "7406232498734157090",
        "effect_id": "7406232498734157090",
        "name": "红色渐变立体文字",
        "is_vip": True
    },
    "粉色梦幻立体": {
        "resource_id": "7404129182244031782",
        "effect_id": "7404129182244031782",
        "name": "粉色梦幻立体",
        "is_vip": True
    },
    "粉色渐变发光花字": {
        "resource_id": "7405578926489160998",
        "effect_id": "7405578926489160998",
        "name": "粉色渐变发光花字",
        "is_vip": True
    },
    "彩色": {
        "resource_id": "7369459252290718986",
        "effect_id": "7369459252290718986",
        "name": "彩色",
        "is_vip": True
    },
    "黄色渐变粉色阴影立体花字": {
        "resource_id": "7495776303799618878",
        "effect_id": "7495776303799618878",
        "name": "黄色渐变粉色阴影立体花字",
        "is_vip": True
    },
    "低饱和蓝色渐变立体白边花字": {
        "resource_id": "7388019320686693686",
        "effect_id": "7388019320686693686",
        "name": "低饱和蓝色渐变立体白边花字",
        "is_vip": True
    },
    "绿色渐变蓝紫色描边花字": {
        "resource_id": "7315437477425155368",
        "effect_id": "7315437477425155368",
        "name": "绿色渐变蓝紫色描边花字",
        "is_vip": True
    },
    "粉色渐变": {
        "resource_id": "7475023258228788505",
        "effect_id": "7475023258228788505",
        "name": "粉色渐变",
        "is_vip": True
    },
    "红色燃烧花字": {
        "resource_id": "7405837403782384906",
        "effect_id": "7405837403782384906",
        "name": "红色燃烧花字",
        "is_vip": True
    },
    "春节喜庆金字红边立体花字": {
        "resource_id": "7460547039252909337",
        "effect_id": "7460547039252909337",
        "name": "春节喜庆金字红边立体花字",
        "is_vip": True
    },
    "斜线纹理黑白漫画感花字": {
        "resource_id": "7405244303586397476",
        "effect_id": "7405244303586397476",
        "name": "斜线纹理黑白漫画感花字",
        "is_vip": True
    },
    "白纸纹理蓝边拼贴花字": {
        "resource_id": "7509039282737302808",
        "effect_id": "7509039282737302808",
        "name": "白纸纹理蓝边拼贴花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7545325777781280024",
        "effect_id": "7545325777781280024",
        "name": "花字",
        "is_vip": True
    },
    "粉笔质感纸张花字": {
        "resource_id": "7538694611150130457",
        "effect_id": "7538694611150130457",
        "name": "粉笔质感纸张花字",
        "is_vip": True
    },
    "黄色立体纹理花字": {
        "resource_id": "7405846768010661157",
        "effect_id": "7405846768010661157",
        "name": "黄色立体纹理花字",
        "is_vip": True
    },
    "像素化花字": {
        "resource_id": "7488161196357487934",
        "effect_id": "7488161196357487934",
        "name": "像素化花字",
        "is_vip": True
    },
    "白色纸质纹理立体": {
        "resource_id": "7406014922078965001",
        "effect_id": "7406014922078965001",
        "name": "白色纸质纹理立体",
        "is_vip": True
    },
    "黄红立体字": {
        "resource_id": "7492626374239243545",
        "effect_id": "7492626374239243545",
        "name": "黄红立体字",
        "is_vip": True
    },
    "像素化花字": {
        "resource_id": "7482734426015730968",
        "effect_id": "7482734426015730968",
        "name": "像素化花字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7480452404811615512",
        "effect_id": "7480452404811615512",
        "name": "花字",
        "is_vip": True
    },
    "金属质感硬朗立体花字": {
        "resource_id": "7405140394662530354",
        "effect_id": "7405140394662530354",
        "name": "金属质感硬朗立体花字",
        "is_vip": True
    },
    "冰雪大世界立体雪花字": {
        "resource_id": "7407272554445999411",
        "effect_id": "7407272554445999411",
        "name": "冰雪大世界立体雪花字",
        "is_vip": True
    },
    "不织布新年红": {
        "resource_id": "7449585330547625228",
        "effect_id": "7449585330547625228",
        "name": "不织布新年红",
        "is_vip": True
    },
    "复古纸张纹理字": {
        "resource_id": "7404377624690101544",
        "effect_id": "7404377624690101544",
        "name": "复古纸张纹理字",
        "is_vip": True
    },
    "花字": {
        "resource_id": "7541849024001740056",
        "effect_id": "7541849024001740056",
        "name": "花字",
        "is_vip": True
    },
    "像素化游戏花字": {
        "resource_id": "7482761022504275262",
        "effect_id": "7482761022504275262",
        "name": "像素化游戏花字",
        "is_vip": True
    },
    "未来科技感赛博斜体字": {
        "resource_id": "7405126783332404517",
        "effect_id": "7405126783332404517",
        "name": "未来科技感赛博斜体字",
        "is_vip": True
    },
    "复古格纹立体花字": {
        "resource_id": "7406192655488519433",
        "effect_id": "7406192655488519433",
        "name": "复古格纹立体花字",
        "is_vip": True
    },
    "清爽冰块纹理字": {
        "resource_id": "7405853759911333172",
        "effect_id": "7405853759911333172",
        "name": "清爽冰块纹理字",
        "is_vip": True
    },
    "绿叶绿色纹理花字": {
        "resource_id": "7435107467366878503",
        "effect_id": "7435107467366878503",
        "name": "绿叶绿色纹理花字",
        "is_vip": True
    },
    "港风图案纹理花字": {
        "resource_id": "7451442109753675070",
        "effect_id": "7451442109753675070",
        "name": "港风图案纹理花字",
        "is_vip": True
    },
    "冰块立体字": {
        "resource_id": "7405824092479196431",
        "effect_id": "7405824092479196431",
        "name": "冰块立体字",
        "is_vip": True
    },
    "蓝色星空花字": {
        "resource_id": "7405857800208928037",
        "effect_id": "7405857800208928037",
        "name": "蓝色星空花字",
        "is_vip": True
    },
    "红色纹理立体花字": {
        "resource_id": "7405855842072808755",
        "effect_id": "7405855842072808755",
        "name": "红色纹理立体花字",
        "is_vip": True
    },
    "复古红轴": {
        "resource_id": "7483893116274117950",
        "effect_id": "7483893116274117950",
        "name": "复古红轴",
        "is_vip": True
    },
    "红黄质感立体花字": {
        "resource_id": "7481535145284160792",
        "effect_id": "7481535145284160792",
        "name": "红黄质感立体花字",
        "is_vip": True
    },
    "蓝紫色发光纹理花字": {
        "resource_id": "7405843250960993586",
        "effect_id": "7405843250960993586",
        "name": "蓝紫色发光纹理花字",
        "is_vip": True
    },
    "牛奶花字": {
        "resource_id": "7532883438072778008",
        "effect_id": "7532883438072778008",
        "name": "牛奶花字",
        "is_vip": True
    },
    "木纹雕刻立体字": {
        "resource_id": "7405870250916384015",
        "effect_id": "7405870250916384015",
        "name": "木纹雕刻立体字",
        "is_vip": True
    },
    "像素化花字": {
        "resource_id": "7486311409861528894",
        "effect_id": "7486311409861528894",
        "name": "像素化花字",
        "is_vip": True
    },
    "粉笔黑板花字（教师节）": {
        "resource_id": "7405550386234281235",
        "effect_id": "7405550386234281235",
        "name": "粉笔黑板花字（教师节）",
        "is_vip": True
    },
    "梦幻爱心纹理底花字": {
        "resource_id": "7330983004631878964",
        "effect_id": "7330983004631878964",
        "name": "梦幻爱心纹理底花字",
        "is_vip": True
    },
    "流光立体花字": {
        "resource_id": "7405693659536051492",
        "effect_id": "7405693659536051492",
        "name": "流光立体花字",
        "is_vip": True
    },
    "蓝色渐变DIY纹理立体花字": {
        "resource_id": "7371332005948083494",
        "effect_id": "7371332005948083494",
        "name": "蓝色渐变DIY纹理立体花字",
        "is_vip": True
    },
    "冬日冰花": {
        "resource_id": "7407265065272937778",
        "effect_id": "7407265065272937778",
        "name": "冬日冰花",
        "is_vip": True
    },
    "红色黑条纹字": {
        "resource_id": "7406984542742924582",
        "effect_id": "7406984542742924582",
        "name": "红色黑条纹字",
        "is_vip": True
    },
    "蓝色天空纹理立体花字": {
        "resource_id": "7406190866626366770",
        "effect_id": "7406190866626366770",
        "name": "蓝色天空纹理立体花字",
        "is_vip": True
    },
    "荧光紫渐变字": {
        "resource_id": "7404383053906267392",
        "effect_id": "7404383053906267392",
        "name": "荧光紫渐变字",
        "is_vip": True
    },
    "红色洒墨花字（书法古风）": {
        "resource_id": "7405523650423639308",
        "effect_id": "7405523650423639308",
        "name": "红色洒墨花字（书法古风）",
        "is_vip": True
    },
    "蓝色渐变立体描边花字": {
        "resource_id": "7405919974411242791",
        "effect_id": "7405919974411242791",
        "name": "蓝色渐变立体描边花字",
        "is_vip": True
    },
    "圣诞-四色纹理": {
        "resource_id": "7306473747953863975",
        "effect_id": "7306473747953863975",
        "name": "圣诞-四色纹理",
        "is_vip": True
    },
    "渐变纹理花字": {
        "resource_id": "7506817303296675123",
        "effect_id": "7506817303296675123",
        "name": "渐变纹理花字",
        "is_vip": True
    },
    "游戏像素化花字": {
        "resource_id": "7486231125992623385",
        "effect_id": "7486231125992623385",
        "name": "游戏像素化花字",
        "is_vip": True
    },
    "花石榴": {
        "resource_id": "7471979945447836952",
        "effect_id": "7471979945447836952",
        "name": "花石榴",
        "is_vip": True
    },
    "紫色纹理描边立体花字": {
        "resource_id": "7405866412570348836",
        "effect_id": "7405866412570348836",
        "name": "紫色纹理描边立体花字",
        "is_vip": True
    },
    "蓝色毛毡绒毛立体花字": {
        "resource_id": "7404145370399329587",
        "effect_id": "7404145370399329587",
        "name": "蓝色毛毡绒毛立体花字",
        "is_vip": True
    },
    "紫色纹理立体发光花字": {
        "resource_id": "7430717597039054143",
        "effect_id": "7430717597039054143",
        "name": "紫色纹理立体发光花字",
        "is_vip": True
    },
    "粉笔蓝白色立体花字": {
        "resource_id": "7405201103903624463",
        "effect_id": "7405201103903624463",
        "name": "粉笔蓝白色立体花字",
        "is_vip": True
    },
    "绿粉圈圈纹理综艺花字": {
        "resource_id": "7546407203654159678",
        "effect_id": "7546407203654159678",
        "name": "绿粉圈圈纹理综艺花字",
        "is_vip": True
    },
    "红色棋盘格纹理立体花字": {
        "resource_id": "7405573811107663155",
        "effect_id": "7405573811107663155",
        "name": "红色棋盘格纹理立体花字",
        "is_vip": True
    },
    "方块游戏花字": {
        "resource_id": "7477911542575516952",
        "effect_id": "7477911542575516952",
        "name": "方块游戏花字",
        "is_vip": True
    },
    "彩色纹理花字": {
        "resource_id": "7406205168200568115",
        "effect_id": "7406205168200568115",
        "name": "彩色纹理花字",
        "is_vip": True
    },
    "绿色粉笔描边花字": {
        "resource_id": "7405201692775451904",
        "effect_id": "7405201692775451904",
        "name": "绿色粉笔描边花字",
        "is_vip": True
    },
    "3D蓝粉色渐变立体花字": {
        "resource_id": "7406173713428745509",
        "effect_id": "7406173713428745509",
        "name": "3D蓝粉色渐变立体花字",
        "is_vip": True
    },
    "红砖纹理立体花字": {
        "resource_id": "7405864219809287433",
        "effect_id": "7405864219809287433",
        "name": "红砖纹理立体花字",
        "is_vip": True
    },
    "蓝黄拼色立体花字": {
        "resource_id": "7405917544126647602",
        "effect_id": "7405917544126647602",
        "name": "蓝黄拼色立体花字",
        "is_vip": True
    },
    "红色花字": {
        "resource_id": "7481938079507418430",
        "effect_id": "7481938079507418430",
        "name": "红色花字",
        "is_vip": True
    }
}